{
  "crops": [
    {
      "id": "1",
      "name": "Ampalaya",
      "scientific_name": "Momordica charantia",
      "description": "Ampalaya, known as bitter melon or bitter gourd in English, is a popular vegetable grown in the Philippines. It is a tropical and subtropical vine belonging to the Cucurbitaceae family. Ampalaya is characterized by its distinct bitter taste, which comes from momordicin, a substance known to have anti-diabetic properties. The ampalaya plant is a climbing vine with tendrils, broad leaves and yellow flowers. The fruit looks like a bumpy cucumber and can range in color from light to dark green. Ampalaya is rich in vitamins and minerals like vitamin A, vitamin C, iron, folic acid and phosphorus. Ampalaya has been used for medicinal purposes in both Ayurvedic and Chinese medicine for centuries. It is traditionally used to help treat diabetes by lowering blood sugar levels. Modern research has validated ampalaya's ability to improve glucose tolerance in people with type 2 diabetes. Ampalaya also has antioxidant, antiviral and antibacterial properties.",
      "image": "ampalaya.jpg",
      "planting_tips": "Here are some tips for successfully growing ampalaya: - Choose a sunny location with well-draining soil. Ampalaya thrives in loamy or sandy loam soil. - Prior to planting, till the soil and mix in aged compost or manure to enrich the soil with nutrients. - Sow the seeds 1 cm deep directly in the ground or start them indoors 3-4 weeks before the last frost. Space the seeds 30 cm apart in rows 90 cm apart. - Water the plants regularly, about 1-2 inches per week. Increase watering during fruit set. - Add a trellis, fence or cage for the vine to climb on. This will prevent the fruit from sitting on the ground. - Weed the area around the plants to prevent competition for water and nutrients. - Side dress with compost tea or organic fertilizer when the vines start to run. ",
      "harvesting_tips": "Here are some useful tips for harvesting ampalaya: - Begin harvesting ampalaya fruits 2 months after sowing. They should be firm with a dark green color. - Use a sharp knife or pruning shears to cut the fruits from the vine, leaving about an inch of stem attached. - Handle the fruits gently to avoid bruising. Ampalaya is delicate and easily damaged. - Harvest ampalaya every 2-3 days during the peak growing season. Check the vines daily. - Harvest in the morning when the fruits are crisp. Avoid picking after rainfall. - Select young, tender fruits under 6 inches long. Overripe fruits tend to be excessively bitter. - Place the freshly harvested ampalaya in a basin of cool water to revive for 30 minutes before storage. - Store freshly picked ampalaya in the refrigerator in a plastic bag for 2-3 days maximum. - Overripe or damaged fruits should be processed immediately by cooking or juicing. - As fruits mature, check the vines more frequently to harvest ampalaya at optimal freshness.",
      "suggested_weather_to_plant": " Ampalaya thrives in hot and humid tropical climates with temperatures between 20°C to 35°C. Here are some tips on the ideal weather conditions to plant ampalaya: - Plant ampalaya at the end of the dry season and the start of the rainy season. This allows the soil to absorb moisture needed for germination. - Ensure daytime temperatures average 27°C to 30°C and nighttime temperatures are above 15°C when planting. - Ampalaya requires at least 30-35 cm of rainfall distributed evenly throughout its growth period. The vines need good moisture. - Avoid planting during heavy monsoon rains which can damage seedlings. Wait for excess water to drain before sowing. - Look for sunny weather with 5-6 hours of direct sunlight daily. Provide shading if temperatures exceed 35°C. - Start seeds indoors if the nighttime temperature is still dropping below 15°C. Move seedlings outdoors when it warms up. - Plant in light, well-draining soil. Clay soils that get waterlogged will cause the plants to rot and die.",
      "tools_needed_to_plant": "These are the basic tools needed to successfully plant ampalaya: - Shovel and spade for preparing soil beds and digging holes for trellising poles - Rake for leveling out the soil and removing debris - Hoe for cultivating weed-free rows - Trowel for transplanting seedlings- Trellis, bamboo poles or fencing for vines to climb on  - Garden line for marking straight rows - Watering can with sprinkler spout for watering soil and seedlings - Granular fertilizer spreader for applying organic fertilizer   - Hand trowel or hand cultivator for weeding around plants - Garden scissors or shears for harvesting ampalaya fruits - Gardening gloves for protecting hands  - Garden fork for turning compost into soil - Wheelbarrow for transporting soil amendments, tools and harvested fruits - Seed trays, pots and seed starting mix if starting seeds indoors - Compost bucket to collect plant waste for fertilizer - Garden stakes and twist ties for securing vines to trelli",
      "how_to_plant": "Follow these steps for planting ampalaya in your garden: Site Selection: - Choose a sunny location with well-draining fertile soil. Avoid frost pockets or heavy clay soil. Soil Preparation:  - Enrich soil with aged compost or manure 2-3 weeks before planting. - Till the top 6 inches of soil. Break up large clumps and remove weeds. Planting Seeds: - Sow 2-3 seeds 1 cm deep and 30 cm apart in rows 90 cm apart. - Keep soil evenly moist until germination in 5-7 days.  Transplanting: - Thin seedlings to the strongest plant every 30 cm once they reach 15 cm tall. - Harden off plants for 7-10 days before transplanting outdoors. Trellising:   - Set up trellises, fencing or poles in parallel rows 60-90 cm apart. - Train 2-3 vines to climb each support structure as they grow. Care: - Water 1-2 inches per week. Avoid wetting foliage.   - Fertilize vines monthly with compost tea or organic fertilizer. - Weed and mulch around plants. - Harvest fruits regularly.",
      "fertilizer_to_use": "Here are some organic fertilizer options to nourish ampalaya vines: Compost - Mix aged compost into the soil before planting and as side dressing during the season. Compost feeds the overall soil ecosystem. Worm Castings - Worm castings provide micronutrients. Side dress vines with a 2 inch layer once a month. Compost Tea - Brew compost tea by steeping compost in water for 3-4 days. Use it to water vines every 2-3 weeks. Manure Teas - Steep cow, chicken, horse, rabbit or sheep manure in water for 2-3 days. Manure provides nitrogen. Fish Emulsion - Fish emulsion is rich in nitrogen and minerals. Dilute it according to instructions and apply monthly. Kelp Meal - Kelp meal offers over 60 trace minerals and growth hormones for strong vines. Top dress monthly. Bone Meal - For phosphorus, mix 2 tbsp bone meal per square foot of soil prior to planting. Wood Ash - Spread a light dusting of wood ash over soil before planting and once a month. Provides potassium."
    },
    {
      "id": "2",
      "name": "Eggplant",
      "scientific_name": "Solanum melongena",
      "description": "Eggplant, also known as aubergine, is a warm season vegetable belonging to the nightshade family. It is a tender perennial grown as an annual in temperate climates. Eggplant produces glossy, oval shaped purple fruits with white flesh that is meaty and mild tasting. The most common varieties are large, teardrop shaped and deep purple skinned. Eggplant contains antioxidants and has a spongy texture that soaks up flavors. It is a staple ingredient in many cuisines and works well in curries, stir fries, grilled dishes and as a meat substitute.",
      "image": "eggplant.jpg",
      "planting_tips": "Here are some tips for growing eggplant: - Start seeds indoors 8-10 weeks before last frost. Transplant seedlings when soil is over 60°F. - Space plants 2 ft apart in rows 3 ft apart. Eggplants need good air circulation. - Grow in fertile, well-draining soil with a pH between 5.5-6.5. Enrich soil with compost. - Mulch around the base of plants to retain moisture and prevent weeds. - Water eggplant deeply and avoid wetting the leaves to prevent fungal diseases. - Use trellising or cages to support the heavy fruits off the ground.",
      "harvesting_tips": "Here are some eggplant harvesting tips: - Begin harvesting eggplant fruits when they reach their mature size but the skin is still glossy and firm. - Use pruners or a knife to snip the fruits from the plant, leaving the calyx and stem attached. - Handle the fruits gently by the stem, avoid bruising them. - Harvest regularly, at least every 2-3 days. Frequent picking encourages more flower production. - Pick early in the day after the dew has dried but before the fruit softens from the sun's heat. - Look carefully under the large leaves which can hide mature fruits.",
      "suggested_weather_to_plant": "Eggplant grows best with: - Warm weather and temperatures between 70-85°F (21-29°C). - Low humidity. Eggplants are susceptible to fungal diseases in humid climates. - Shelter from cool or windy conditions. Eggplants are a heat loving plant. - Bright sunshine. Eggplants need at least 6 hours of direct sun daily.",
      "tools_needed_to_plant": "- Row covers or greenhouse for starting seeds early indoors. - Trellises, tomato cages, or stakes for supporting heavy fruits. - Sharp pruners or knife for harvesting fruits. - Garden trowel for transplanting seedlings. - Mulch for retaining soil moisture and reducing weeds.",
      "how_to_plant": "Here is a summary of planting eggplant: - Start seeds indoors 6-8 weeks before last spring frost date. Use grow lights and heat mats. - Harden off and transplant seedlings 18-24 inches apart after danger of frost when soil is over 60°F. - Add trellises or cages at time of transplanting for support. - Water newly transplanted seedlings daily until established. Provide 1-2 inches of water per week. - Side dress with compost or fertilizer when fruits start developing. - Harvest fruits regularly with pruners, cutting the stems instead of pulling.",
      "fertilizer_to_use": "Good organic fertilizer options for eggplants include: - Compost or aged manure before planting to enrich soil nutrients. - Fish emulsion that is high in nitrogen to promote lush foliage growth. - Worm castings or compost tea every 3-4 weeks provides micronutrients. - Bone meal to prevent blossom end rot due to calcium deficiency."
    },
    {
      "id": "3",
      "name": "Tomato",
      "scientific_name": "Solanum lycopersicum",
      "description": "Tomatoes are a warm season vegetable in the nightshade family grown for their nutritious fruits. High yields of tomatoes can be grown in the home garden with proper care. There are many varieties ranging from bite-sized cherry tomatoes to large beefsteak types. Tomatoes come in a rainbow of colors from red, pink, orange, yellow, purple, green, and even black. The plants produce clusters of flowers that develop into juicy fruits full of lycopene, an antioxidant. Tomatoes are a versatile ingredient and an essential part of many cuisines.",
      "image": "tomato.jpg",
      "planting_tips": "Tips for planting tomatoes: - Start seeds indoors 6-8 weeks before transplanting date. Use grow lights and heating mats. - Harden off and transplant outdoors after danger of frost. Space 18-36 in apart depending on variety. - Choose a sunny spot with fertile, well-draining soil. Amend soil with compost. - Use cages, stakes and trellises to support plants and prevent disease. - Water at soil level. Use drip irrigation or soaker hoses to avoid wetting leaves. - Use fabric row covers at planting for frost protection and pest control.",
      "harvesting_tips": "Tomato harvesting tips: - Pick tomatoes when fully colored but still firm. Harvest early morning. - Gently twist tomatoes off the vine. Be careful not to bruise.  - Use pruners or shears for harvesting to avoid damaging the plant. - Pick ripe tomatoes every 2-3 days to encourage more fruit production.  - Store freshly picked tomatoes at room temperature out of direct sunlight.  - Avoid refrigerating tomatoes. The cold damages membranes and flavor. Only refrigerate extra ripe tomatoes.",
      "suggested_weather_to_plant": "Ideal weather for growing tomatoes: - Daytime temperatures between 70-85°F (21-29°C). - Nighttime temperatures above 55°F (13°C). - Low humidity. Prevent fungal disease. - At least 6-8 hours of direct sunlight daily. - Consistent moisture through the growing season. Mulch helps. - Avoid heavy rains near harvest that can crack ripe tomatoes.",
      "tools_needed_to_plant": "- Stakes, cages, trellises for supporting plants - Watering tools like drip irrigation for soil watering - Sharp bypass pruners for harvesting fruits - Fabric row covers for protecting plants - Garden trowel for transplanting seedlings",
      "how_to_plant": "Steps for planting tomatoes: - Start seeds indoors 6-8 weeks before last spring frost. Use grow lights.  - Transplant outdoors after hardening off, 18-36 in. apart depending on variety. Add supports. - Amend soil with compost before planting. Side dress with fertilizer. - Water at soil level to keep foliage dry and prevent disease. - Use fabric row covers at planting to enhance growth. - Harvest fully colored fruits every 2-3 days by gently twisting off vine.",
      "fertilizer_to_use": "Good organic fertilizers for tomatoes: - Compost and aged manure provides a complete nutritional boost. - Fish emulsion is high in nitrogen for leaf growth. - Worm castings and compost tea offer beneficial microbes. - Bone meal prevents blossom end rot by providing calcium."
    }
  ]
}
