{
  "crops": [
    {
      "id": "1",
      "name": "Bitter Gourd (Ampalaya)",
      "pronunciation": "bit-ter gourd",
      "family": "Cucurbitaceae",
      "genus": "Momordica",
      "scientific_name": "Momordica charantia",
      "description": "Ampalaya, known as bitter melon or bitter gourd in English, is a popular vegetable grown in the Philippines. It is a tropical and subtropical vine belonging to the Cucurbitaceae family. Ampalaya is characterized by its distinct bitter taste, which comes from momordicin, a substance known to have anti-diabetic properties. The ampalaya plant is a climbing vine with tendrils, broad leaves and yellow flowers. The fruit looks like a bumpy cucumber and can range in color from light to dark green. Ampalaya is rich in vitamins and minerals like vitamin A, vitamin C, iron, folic acid and phosphorus. Ampalaya has been used for medicinal purposes in both Ayurvedic and Chinese medicine for centuries. It is traditionally used to help treat diabetes by lowering blood sugar levels. Modern research has validated ampalaya's ability to improve glucose tolerance in people with type 2 diabetes. Ampalaya also has antioxidant, antiviral and antibacterial properties.",
      "image": "https://www.pngmart.com/files/15/Fresh-Bitter-Gourd-Transparent-PNG.png",
      "planting_tips": "Here are some tips for successfully growing ampalaya:\n \n\n• Choose a sunny location with well-draining soil. Ampalaya thrives in loamy or sandy loam soil.\n\n• Prior to planting, till the soil and mix in aged compost or manure to enrich the soil with nutrients.\n\n• Sow the seeds 1 cm deep directly in the ground or start them indoors 3-4 weeks before the last frost. Space the seeds 30 cm apart in rows 90 cm apart.\n\n• Water the plants regularly, about 1-2 inches per week. Increase watering during fruit set.\n\n• Add a trellis, fence or cage for the vine to climb on. This will prevent the fruit from sitting on the ground.\n\n• Weed the area around the plants to prevent competition for water and nutrients.\n\n• Side dress with compost tea or organic fertilizer when the vines start to run. ",
      "harvesting_tips": "Here are some useful tips for harvesting ampalaya: \n\n• Begin harvesting ampalaya fruits 2 months after sowing. They should be firm with a dark green color. \n\n• Use a sharp knife or pruning shears to cut the fruits from the vine, leaving about an inch of stem attached. \n\n• Handle the fruits gently to avoid bruising. Ampalaya is delicate and easily damaged. \n\n• Harvest ampalaya every 2-3 days during the peak growing season. Check the vines daily. \n\n• Harvest in the morning when the fruits are crisp. Avoid picking after rainfall. \n\n• Select young, tender fruits under 6 inches long. Overripe fruits tend to be excessively bitter. \n\n• Place the freshly harvested ampalaya in a basin of cool water to revive for 30 minutes before storage. \n\n• Store freshly picked ampalaya in the refrigerator in a plastic bag for 2-3 days maximum. \n\n• Overripe or damaged fruits should be processed immediately by cooking or juicing. \n\n• As fruits mature, check the vines more frequently to harvest ampalaya at optimal freshness.",
      "suggested_weather_to_plant": " Ampalaya thrives in hot and humid tropical climates with temperatures between 20°C to 35°C. Here are some tips on the ideal weather conditions to plant ampalaya: \n\n• Plant ampalaya at the end of the dry season and the start of the rainy season. This allows the soil to absorb moisture needed for germination. \n\n• Ensure daytime temperatures average 27°C to 30°C and nighttime temperatures are above 15°C when planting. \n\n• Ampalaya requires at least 30-35 cm of rainfall distributed evenly throughout its growth period. The vines need good moisture. \n\n• Avoid planting during heavy monsoon rains which can damage seedlings. Wait for excess water to drain before sowing. \n\n• Look for sunny weather with 5-6 hours of direct sunlight daily. Provide shading if temperatures exceed 35°C. \n\n• Start seeds indoors if the nighttime temperature is still dropping below 15°C. Move seedlings outdoors when it warms up. \n\n• Plant in light, well-draining soil. Clay soils that get waterlogged will cause the plants to rot and die.",
      "tools_needed_to_plant": "These are the basic tools needed to successfully plant ampalaya: \n\n• Shovel and spade for preparing soil beds and digging holes for trellising poles \n\n• Rake for leveling out the soil and removing debris \n\n• Hoe for cultivating weed-free rows \n\n• Trowel for transplanting seedlings• Trellis, bamboo poles or fencing for vines to climb on  \n\n• Garden line for marking straight rows \n\n• Watering can with sprinkler spout for watering soil and seedlings \n\n• Granular fertilizer spreader for applying organic fertilizer   \n\n• Hand trowel or hand cultivator for weeding around plants \n\n• Garden scissors or shears for harvesting ampalaya fruits \n\n• Gardening gloves for protecting hands  \n\n• Garden fork for turning compost into soil \n\n• Wheelbarrow for transporting soil amendments, tools and harvested fruits \n\n• Seed trays, pots and seed starting mix if starting seeds indoors \n\n• Compost bucket to collect plant waste for fertilizer \n\n• Garden stakes and twist ties for securing vines to trelli",
      "how_to_plant": "Follow these steps for planting ampalaya in your garden: Site Selection: \n\n• Choose a sunny location with well-draining fertile soil. Avoid frost pockets or heavy clay soil. Soil Preparation:  \n\n• Enrich soil with aged compost or manure 2-3 weeks before planting. \n\n• Till the top 6 inches of soil. Break up large clumps and remove weeds. Planting Seeds: \n\n• Sow 2-3 seeds 1 cm deep and 30 cm apart in rows 90 cm apart. \n\n• Keep soil evenly moist until germination in 5-7 days.  Transplanting: \n\n• Thin seedlings to the strongest plant every 30 cm once they reach 15 cm tall. \n\n• Harden off plants for 7-10 days before transplanting outdoors. Trellising:   \n\n• Set up trellises, fencing or poles in parallel rows 60-90 cm apart. \n\n• Train 2-3 vines to climb each support structure as they grow. Care: \n\n• Water 1-2 inches per week. Avoid wetting foliage.   \n\n• Fertilize vines monthly with compost tea or organic fertilizer. \n\n• Weed and mulch around plants. \n\n• Harvest fruits regularly.",
      "fertilizer_to_use": "Here are some organic fertilizer options to nourish ampalaya vines: Compost \n\n• Mix aged compost into the soil before planting and as side dressing during the season. Compost feeds the overall soil ecosystem. Worm Castings \n\n• Worm castings provide micronutrients. Side dress vines with a 2 inch layer once a month. Compost Tea \n\n• Brew compost tea by steeping compost in water for 3-4 days. Use it to water vines every 2-3 weeks. Manure Teas \n\n• Steep cow, chicken, horse, rabbit or sheep manure in water for 2-3 days. Manure provides nitrogen. Fish Emulsion \n\n• Fish emulsion is rich in nitrogen and minerals. Dilute it according to instructions and apply monthly. Kelp Meal \n\n• Kelp meal offers over 60 trace minerals and growth hormones for strong vines. Top dress monthly. Bone Meal \n\n• For phosphorus, mix 2 tbsp bone meal per square foot of soil prior to planting. Wood Ash \n\n• Spread a light dusting of wood ash over soil before planting and once a month. Provides potassium."
    },
    {
      "id": "2",
      "name": "Eggplant (Talong)",
      "pronunciation": "egg-plant",
      "family": "Solanaceae",
      "genus": "Solanum",
      "scientific_name": "Solanum melongena",
      "description": "Eggplant, also known as aubergine, is a warm season vegetable belonging to the nightshade family. It is a tender perennial grown as an annual in temperate climates. Eggplant produces glossy, oval shaped purple fruits with white flesh that is meaty and mild tasting. The most common varieties are large, teardrop shaped and deep purple skinned. Eggplant contains antioxidants and has a spongy texture that soaks up flavors. It is a staple ingredient in many cuisines and works well in curries, stir fries, grilled dishes and as a meat substitute.",
      "image": "https://www.pngmart.com/files/15/Eggplant-Brinjal-PNG-Picture.png",
      "planting_tips": "Here are some tips for growing eggplant: \n\n• Start seeds indoors 8-10 weeks before last frost. Transplant seedlings when soil is over 60°F. \n\n• Space plants 2 ft apart in rows 3 ft apart. Eggplants need good air circulation. \n\n• Grow in fertile, well-draining soil with a pH between 5.5-6.5. Enrich soil with compost. \n\n• Mulch around the base of plants to retain moisture and prevent weeds. \n\n• Water eggplant deeply and avoid wetting the leaves to prevent fungal diseases. \n\n• Use trellising or cages to support the heavy fruits off the ground.",
      "harvesting_tips": "Here are some eggplant harvesting tips: \n\n• Begin harvesting eggplant fruits when they reach their mature size but the skin is still glossy and firm. \n\n• Use pruners or a knife to snip the fruits from the plant, leaving the calyx and stem attached. \n\n• Handle the fruits gently by the stem, avoid bruising them. \n\n• Harvest regularly, at least every 2-3 days. Frequent picking encourages more flower production. \n\n• Pick early in the day after the dew has dried but before the fruit softens from the sun's heat. \n\n• Look carefully under the large leaves which can hide mature fruits.",
      "suggested_weather_to_plant": "Eggplant grows best with: \n\n• Warm weather and temperatures between 70-85°F (21-29°C). \n\n• Low humidity. Eggplants are susceptible to fungal diseases in humid climates. \n\n• Shelter from cool or windy conditions. Eggplants are a heat loving plant. \n\n• Bright sunshine. Eggplants need at least 6 hours of direct sun daily.",
      "tools_needed_to_plant": "• Row covers or greenhouse for starting seeds early indoors. \n\n• Trellises, tomato cages, or stakes for supporting heavy fruits. \n\n• Sharp pruners or knife for harvesting fruits. \n\n• Garden trowel for transplanting seedlings. \n\n• Mulch for retaining soil moisture and reducing weeds.",
      "how_to_plant": "Here is a summary of planting eggplant: \n\n• Start seeds indoors 6-8 weeks before last spring frost date. Use grow lights and heat mats. \n\n• Harden off and transplant seedlings 18-24 inches apart after danger of frost when soil is over 60°F. \n\n• Add trellises or cages at time of transplanting for support. \n\n• Water newly transplanted seedlings daily until established. Provide 1-2 inches of water per week. \n\n• Side dress with compost or fertilizer when fruits start developing. \n\n• Harvest fruits regularly with pruners, cutting the stems instead of pulling.",
      "fertilizer_to_use": "Good organic fertilizer options for eggplants include: \n\n• Compost or aged manure before planting to enrich soil nutrients. \n\n• Fish emulsion that is high in nitrogen to promote lush foliage growth. \n\n• Worm castings or compost tea every 3-4 weeks provides micronutrients. \n\n• Bone meal to prevent blossom end rot due to calcium deficiency."
    },
    {
      "id": "3",
      "name": "Tomato (Kamatis)",
      "pronunciation": "toh-mey-toh",
      "family": "Solanaceae",
      "genus": "Solanum",
      "scientific_name": "Solanum lycopersicum",
      "description": "Tomatoes are a warm season vegetable in the nightshade family grown for their nutritious fruits. High yields of tomatoes can be grown in the home garden with proper care. There are many varieties ranging from bite-sized cherry tomatoes to large beefsteak types. Tomatoes come in a rainbow of colors from red, pink, orange, yellow, purple, green, and even black. The plants produce clusters of flowers that develop into juicy fruits full of lycopene, an antioxidant. Tomatoes are a versatile ingredient and an essential part of many cuisines.",
      "image": "https://freepngimg.com/thumb/tomato/6-tomato-png-image.png",
      "planting_tips": "Tips for planting tomatoes: \n\n• Start seeds indoors 6-8 weeks before transplanting date. Use grow lights and heating mats. \n\n• Harden off and transplant outdoors after danger of frost. Space 18-36 in apart depending on variety. \n\n• Choose a sunny spot with fertile, well-draining soil. Amend soil with compost. \n\n• Use cages, stakes and trellises to support plants and prevent disease. \n\n• Water at soil level. Use drip irrigation or soaker hoses to avoid wetting leaves. \n\n• Use fabric row covers at planting for frost protection and pest control.",
      "harvesting_tips": "Tomato harvesting tips: \n\n• Pick tomatoes when fully colored but still firm. Harvest early morning. \n\n• Gently twist tomatoes off the vine. Be careful not to bruise.  \n\n• Use pruners or shears for harvesting to avoid damaging the plant. \n\n• Pick ripe tomatoes every 2-3 days to encourage more fruit production.  \n\n• Store freshly picked tomatoes at room temperature out of direct sunlight.  \n\n• Avoid refrigerating tomatoes. The cold damages membranes and flavor. Only refrigerate extra ripe tomatoes.",
      "suggested_weather_to_plant": "Ideal weather for growing tomatoes: \n\n• Daytime temperatures between 70-85°F (21-29°C). \n\n• Nighttime temperatures above 55°F (13°C). \n\n• Low humidity. Prevent fungal disease. \n\n• At least 6-8 hours of direct sunlight daily. \n\n• Consistent moisture through the growing season. Mulch helps. \n\n• Avoid heavy rains near harvest that can crack ripe tomatoes.",
      "tools_needed_to_plant": "• Stakes, cages, trellises for supporting plants \n\n• Watering tools like drip irrigation for soil watering \n\n• Sharp bypass pruners for harvesting fruits \n\n• Fabric row covers for protecting plants \n\n• Garden trowel for transplanting seedlings",
      "how_to_plant": "Steps for planting tomatoes: \n\n• Start seeds indoors 6-8 weeks before last spring frost. Use grow lights.  \n\n• Transplant outdoors after hardening off, 18-36 in. apart depending on variety. Add supports. \n\n• Amend soil with compost before planting. Side dress with fertilizer. \n\n• Water at soil level to keep foliage dry and prevent disease. \n\n• Use fabric row covers at planting to enhance growth. \n\n• Harvest fully colored fruits every 2-3 days by gently twisting off vine.",
      "fertilizer_to_use": "Good organic fertilizers for tomatoes: \n\n• Compost and aged manure provides a complete nutritional boost. \n\n• Fish emulsion is high in nitrogen for leaf growth. \n\n• Worm castings and compost tea offer beneficial microbes. \n\n• Bone meal prevents blossom end rot by providing calcium."
    },
    {
      "id": "4",
      "name": "Lettuce (Litsugas)",
      "pronunciation": "let-is",
      "family": "Asteraceae",
      "genus": "Lactuca",
      "scientific_name": "Lactuca sativa",
      "description": "Lettuce is a fast growing, leafy vegetable grown for harvesting young greens. There are many varieties including crisphead, romaine, leaf and butterhead. Lettuce has mild flavor and is commonly used in salads, sandwiches, wraps and other raw preparations. It is packed with vitamins A, K and C, and provides antioxidants, folate and fiber. Lettuce can be grown as a cut-and-come-again crop or transplanted for full head production.",
      "image": "https://images.pngnice.com/download/2121/Green-Lettuce-PNG-Transparent-Image.png",
      "planting_tips": "• Direct sow lettuce seeds in early spring and fall when temperatures are cool. \n\n• Give plants 10-12 in of space between rows to allow air circulation. \n\n• Grow lettuce in fertile soil with plenty of organic matter. Side dress with compost. \n\n• Consistent moisture is essential, especially when plants are young. Water at soil level. \n\n• Interplant lettuce with slower growing vegetables like peppers, tomatoes or onions.",
      "harvesting_tips": "• Harvest lettuce in the morning after dew dries but before the sun gets hot. \n\n• Use a sharp knife to cut lettuce just above soil level for cut-and-come-again harvesting. \n\n• Allow heads to fully fill out before harvesting. Look for firm, tightly wrapped leaves. \n\n• Gently wash and spin dry lettuce right after picking. Store in refrigerator. \n\n• Pick outer leaves first when harvesting head lettuce. Inner leaves will continue growing.",
      "suggested_weather_to_plant": "• Lettuce prefers cool weather with temperatures between 45-75°F (7-24°C). \n\n• Grow lettuce in spring and fall in most climates, avoiding summer heat. \n\n• In warm regions, grow lettuce in winter. Provide shade when temperatures rise. \n\n• Lettuce thrives in cool, moist conditions. Consistent watering is key. \n\n• Hot temperatures will cause lettuce to bolt and turn bitter quickly.",
      "tools_needed_to_plant": "• Seed trays and starting mix for indoor seed starting \n\n• Row covers to protect newly planted seeds and seedlings \n\n• Sharp kitchen knife for harvesting fully grown heads or leaves \n\n• Garden scissors for harvesting baby greens \n\n• Mist bottle for gently rinsing lettuce after picking",
      "how_to_plant": "• Direct sow seeds outdoors 1/4-1/2 in deep in early spring/fall, or start seeds indoors. \n\n• Space plants 10-12 in apart in rows at least 12 in apart. Wide rows allow air flow. \n\n• Use row covers at seeding to enhance germination and prevent pests. \n\n• Keep soil consistently moist, watering at base. Avoid wetting leaves. \n\n• Side dress with compost once plants reach 3-4 in tall. \n\n• Harvest outer leaves or whole heads when mature.",
      "fertilizer_to_use": "Good organic fertilizer choices for lettuce: \n\n• Compost or aged manure for overall soil enrichment. \n\n• Fish emulsion mixed with compost tea provides nitrogen and micronutrients. \n\n• Seaweed extract helps lettuce resist bolting and enhances flavor."
    },
    {
      "id": "5",
      "name": "Onion (Sibuyas)",
      "pronunciation": "uhn-yuhn",
      "family": "Amaryllidaceae",
      "genus": "Allium",
      "scientific_name": "Allium cepa",
      "description": "Onions are vegetable crops grown for their edible bulbs. They come in a range of colors, sizes, shapes and flavors. Common varieties are yellow, white and red onions. They can be eaten raw, cooked, fried, dried or roasted and lend flavor to many dishes. Onions are high in vitamin C, antioxidants and dietary fiber. Onions grow best in loose, fertile soil with full sun exposure. They can be grown from seeds, sets or transplants.",
      "image": "https://www.freepnglogos.com/uploads/onion-png/download-red-onion-png-image-pngimg-34.png",
      "planting_tips": "Here are some tips for planting onions: \n\n• Prepare soil in advance by mixing in aged compost or manure. Onions prefer loose, fertile soil. \n\n• Direct sow onion seeds outdoors as soon as the ground can be worked in spring. Plant 1/2 inch deep, 1-2 inches apart in rows 12 inches apart. Thin seedlings when 2 inches tall. \n\n• Onion sets can be planted 1-2 inches deep, 4-6 inches apart in rows 12-15 inches apart. \n\n• Transplants should be planted 4-6 inches apart in rows 12-15 inches apart. \n\n• Side dress with balanced organic fertilizer when bulbs start swelling.",
      "harvesting_tips": "Tips for harvesting onions: \n\n• Stop watering onion crops once the tops fall over and begin to dry out. This initiates the curing process. \n\n• Allow tops to dry out for 1-2 weeks before harvesting bulbs. Avoid damaging the necks when pulling onions. \n\n• Loosen soil with a garden fork and pull bulbs by hand. Brush off excess dirt but don't wash yet. \n\n• Cure onions in a warm, dry, shaded location for 1-2 weeks with good air circulation to properly dry out necks. \n\n• Once cured, cut back tops to 1 inch, roots to 1/2 inch and store in a cool, dry location.",
      "suggested_weather_to_plant": "Onions grow best in cool weather: \n\n• Optimal soil temperature for planting is 55-70°F. Onion seeds won't germinate in cold soil. \n\n• They can tolerate air temperatures down to 20°F after seedlings emerge. Use row covers if colder.    \n\n• Hot temperatures can cause onions to bolt before fully maturing. Maintain cool soil temps. \n\n• Onions need at least 8 hours of sunlight per day. \n\n• Consistent moisture is important for bulbing. Water deeply 1-2 times per week if rain is lacking.",
      "tools_needed_to_plant": "• Garden fork for preparing soil \n\n• Row covers for protecting seedlings \n\n• Garden line for planting straight rows \n\n• Hand trowel for thinning seedlings \n\n• Garden hose or drip irrigation for deep watering \n\n• Paper bags or mesh bags for curing harvested onions",
      "how_to_plant": "How to plant onions: \n\n• Choose a sunny spot with fertile, loose, well-draining soil. Amend with compost before planting. \n\n• Direct sow seeds 1/2 inch deep and 1-2 inches apart in rows 12 inches apart as soon as soil can be worked in spring. \n\n• Once seedlings are 2 inches tall, thin to 4-6 inches between plants. \n\n• Side dress with balanced organic fertilizer when bulbs begin swelling. \n\n• Stop watering once tops fall over and begin drying out. Allow tops to dry completely before harvesting.",
      "fertilizer_to_use": "Good organic fertilizers for onions include: \n\n• Compost or aged manure before planting to enrich soil. \n\n• Balanced organic fertilizer when bulbing begins to size up bulbs. \n\n• Fish emulsion or compost tea every 3-4 weeks provides nitrogen. \n\n• Wood ash provides potassium for large, healthy bulbs."
    },
    {
      "id": "6",
      "name": "Garlic (Bawang)",
      "pronunciation": "gar-lik",
      "family": "Amaryllidaceae",
      "genus": "Allium",
      "scientific_name": "Allium sativum",
      "description": "Garlic is a strongly flavored bulb crop that is closely related to the onion. It is grown for its pungent bulbs made up of cloves. Garlic has a long history of use as a culinary ingredient and medicinal herb. Modern research has shown it has antimicrobial, antitumor and cardiovascular benefits. The hardy garlic plant grows 1-3 feet tall on long, flat leaves and produces a bulb underground divided into individual cloves. Hardneck and softneck are the most common varieties grown.",
      "image": "https://pngimg.com/uploads/garlic/garlic_PNG12772.png",
      "planting_tips": "Here are some garlic planting tips: \n\n• Plant garlic in the fall or early spring 4-6 weeks before last frost. \n\n• Choose a sunny site with well-draining fertile soil. Raised beds enriched with compost work well. \n\n• Separate bulbs into individual cloves. Plant the largest cloves 2 inches deep and 6 inches apart in rows 12 inches apart. \n\n• Side dress plants with a balanced organic fertilizer in early spring to support growth. \n\n• Mulch around plants to prevent weeds, retain moisture and insulate soil. Avoid wetting foliage.",
      "harvesting_tips": "Tips for harvesting garlic: \n\n• Stop watering when the bottom 3-4 leaves turn brown and dry. \n\n• Use a garden fork to loosen soil and carefully lift bulbs by the stalks. Gently brush off excess dirt. \n\n• Cure bulbs in a shaded, dry, warm location with good air flow for 2-3 weeks. \n\n• Once cured, cut off roots and stems to 1 inch. Store in mesh bags or braid tops in a cool, dry place.",
      "suggested_weather_to_plant": "Ideal weather conditions for planting garlic are: \n\n• Cool air temperatures between 40-70°F. Avoid frost and freezing. \n\n• Plant fall planted garlic 4-6 weeks before first expected frost. \n\n• Plant spring planted garlic as soon as soil can be worked. \n\n• Grow garlic in full sun. It needs at least 6 hours of direct sunlight. \n\n• Moist, well-drained soil. Heavier soil if planting in fall, lighter in spring.",
      "tools_needed_to_plant": "• Garden spade for preparing soil beds \n\n• Row covers to protect fall plantings \n\n• Garden dibber or hand trowel for planting cloves \n\n• Soft garden ties for bundling harvested garlic",
      "how_to_plant": "How to plant garlic: \n\n• Prepare growing beds in fall by mixing in aged compost or manure. \n\n• Break bulbs into individual cloves. Select large, healthy cloves for planting. \n\n• Plant the cloves 2 inches deep and 6 inches apart in rows 12 inches apart.  \n\n• Cover beds with 3-4 inches of straw or mulch for insulation. \n\n• Side dress with balanced organic fertilizer in early spring. \n\n• Stop watering once lower leaves begin drying out and cure bulbs before storing.",
      "fertilizer_to_use": "Good organic fertilizers for garlic include: \n\n• Compost or manure before planting for rich soil. \n\n• Balanced organic fertilizer in early spring for nutrients. \n\n• Fish emulsion every 3-4 weeks to provide nitrogen. \n\n• Epsom salts provides magnesium for robust cloves."
    },
    {
      "id": "7",
      "name": "Potato (Patatas)",
      "pronunciation": "puh-tey-toh",
      "family": "Solanaceae",
      "genus": "Solanum",
      "scientific_name": "Solanum tuberosum",
      "description": "Potatoes are starchy root vegetables grown for their nutritious tubers. They come in a rainbow of skin and flesh colors including brown, yellow, red, purple, white and even blue. Potatoes are rich in vitamins, minerals and antioxidants. They provide a good source of fiber, potassium, vitamin C and B6. Potatoes prefer cool weather and grow on compact, bushy plants 1-3 feet tall. They are propagated by planting seed potatoes or potato pieces containing eyes.",
      "image": "https://pngimg.com/uploads/potato/potato_PNG438.png",
      "planting_tips": "Tips for planting potatoes: \n\n• Choose a sunny spot with loose, fertile soil. Amend soil with compost before planting. \n\n• Purchase certified disease-free seed potatoes. Cut large tubers into smaller pieces containing at least 2 eyes. \n\n• Plant seed pieces 3-4 inches deep and 12 inches apart in rows spaced 2-3 feet apart once soil reaches 50°F. \n\n• Gradually hill up soil over the plants as they grow until mounds are 8-10 inches tall. This allows tubers to develop underground. \n\n• Irrigate evenly throughout growth cycle. Avoid wetting tubers which can cause rot.",
      "harvesting_tips": "Potato harvesting tips: \n\n• Stop watering potato plants 2 weeks before harvest to set tuber skins. \n\n• Use a garden fork to gently lift hills, starting from the outside and working in. \n\n• Gently rub off loose soil, taking care not to damage delicate skins. \n\n• Cure freshly dug potatoes in the shade for 2 weeks to toughen skins. \n\n• Discard any tubers with cuts, bruises or green skin which indicates sun exposure.",
      "suggested_weather_to_plant": "Ideal growing conditions for potatoes are: \n\n• Cool weather with temperatures of 65-70°F during the day. Nights under 55°F. \n\n• Plant 1-2 weeks before the last expected spring frost when soil reaches 50°F. \n\n• Full sun. Potatoes need at least 8 hours of direct sunlight for maximum yield. \n\n• Consistent moisture, about 1 inch per week. Avoid waterlogged soil. \n\n• Shelter from strong winds which can damage stems and leaves.",
      "tools_needed_to_plant": "• Garden fork for digging and aerating soil \n\n• Seed potatoes or potato pieces with eyes for planting \n\n• Garden hoe for hilling soil around plants \n\n• Sturdy shovel for gently lifting potato hills at harvest",
      "how_to_plant": "How to plant potatoes: \n\n• Choose disease-free seed potatoes and cut into smaller pieces, each with 1-2 eyes. \n\n• Dig trenches or holes 3-4 inches deep and 12 inches apart. Space rows 2-3 feet apart. \n\n• Place seed pieces in trench, eyes facing up, and cover with 4 inches of soil. \n\n• Continue hilling up soil as plants grow until mounds are 8-10 inches tall. \n\n• Allow potato foliage to die back before harvesting tubers with a garden fork.",
      "fertilizer_to_use": "Good organic fertilizers for potatoes include: \n\n• Compost or aged manure to prepare soil beds. \n\n• Balanced organic fertilizer to support overall growth. \n\n• Fish emulsion, blood meal or kelp meal to provide added nitrogen."
    },
    {
      "id": "8",
      "name": "Carrot (Karot)",
      "pronunciation": "kar-it",
      "family": "Apiaceae",
      "genus": "Daucus",
      "scientific_name": "Daucus carota subsp. sativus",
      "description": "Carrots are crunchy, sweet rooted vegetables typically orange in color but can range from yellow and purple to red and white. They are excellent sources of vitamin A, biotin, potassium and antioxidants. Carrots prefer sandy, loose soil and cool temperatures. They are direct sown as seeds, maturing in about 2-3 months. Carrots can be harvested early when roots are small or left to reach full size maturity.",
      "image": "https://purepng.com/public/uploads/large/purepng.com-carrotscarrotvegetablesfreshdeliciousefoodhealthycarrots-481521740717jmglq.png",
      "planting_tips": "Carrot planting tips: \n\n• Sow carrot seeds directly in the garden 2-4 weeks before last frost. \n\n• Prepare soil by mixing in compost to loosen and fertilize. Carrots need deep loose soil to develop properly. \n\n• Sow seeds 1/4 inch deep and 1 inch apart in rows 12-18 inches apart. Thin seedlings to 2 inches. \n\n• Keep soil consistently moist until seedlings emerge which takes 14-21 days. \n\n• Use row covers at seeding to protect tender shoots and prevent insect pests.",
      "harvesting_tips": "Tips for harvesting carrots: \n\n• Begin harvesting carrots when roots reach desired size. Baby carrots are ready in 30-50 days.   \n\n• Loosen soil gently with a garden fork, then pull up carrots carefully by grasping tops. \n\n• Cut off green tops, leaving 1-2 inches of stem attached to root. \n\n• Rinse off excess soil using a gentle spray. Dry before storing. \n\n• Twist off thinner side roots. Use care not to damage main taproot. \n\n• Store unwashed carrots in plastic bags with a damp paper towel in the refrigerator.",
      "suggested_weather_to_plant": "Ideal conditions for growing carrots are: \n\n• Cool weather with air temperatures of 60-70°F. \n\n• Soil temperatures between 45-85°F. Won't sprout in cold soil. \n\n• Plant early spring and late summer/early fall in most climates. \n\n• Sunny location with at least 6 hours of direct sunlight daily. After germinating, tolerate partial shade. \n\n• Moist but well-drained, sandy loam soil. Heavy soil causes stunted, misshapen roots.",
      "tools_needed_to_plant": "• Row covers for protecting seedlings \n\n• Garden fork for aerating and loosening soil \n\n• Garden rake for creating planting rows \n\n• Tomato cages or boards to prevent soil cracking as roots develop \n\n• Garden or spray hose for gently washing freshly dug carrots",
      "how_to_plant": "How to plant carrots: \n\n• Prepare soil by mixing in aged compost. Carrots need loose, deep soil. \n\n• Plant seeds 1/4 inch deep and 1 inch apart in rows 12-18 inches apart. \n\n• Cover rows with fabric row covers to retain moisture and prevent weeds. \n\n• Keep soil moist until seedlings emerge in 2-3 weeks. \n\n• Thin carrots to 2 inches apart once they are 2 inches tall. \n\n• Gently hill soil or mulch around shoulders as roots grow to prevent greening.",
      "fertilizer_to_use": "Good organic fertilizers for carrots include: \n\n• Well aged compost or manure worked into soil to loosen and provide nutrients. \n\n• Fish emulsion every 3-4 weeks to provide nitrogen for foliage growth. \n\n• Compost tea supplies beneficial microbes and micronutrients."
    },
    {
      "id": "9",
      "name": "Cabbage (Repolyo)",
      "pronunciation": "kab-ij",
      "family": "Brassicaceae",
      "genus": "Brassica",
      "scientific_name": "Brassica oleracea var. capitata",
      "description": "Cabbage is a hardy, cool season vegetable grown for its dense-leaved heads. It comes in green, red and savoy varieties. Cabbage has high amounts of vitamin C and K, contains potent antioxidants and has anti-inflammatory benefits. It can be eaten raw, cooked, fermented into sauerkraut or kimchi, or used in stir fries and soups. Cabbage grows best in cool weather and full sun. It prefers fertile, well-drained soil with plenty of organic matter.",
      "image": "https://purepng.com/public/uploads/large/purepng.com-cabbagecabbagevegetablesgreenfoodcalenonesense-481521740207fhzh1.png",
      "planting_tips": "Tips for planting cabbage: \n\n• Start seeds indoors 5-7 weeks before last frost. Harden off and transplant after danger of frost.  \n\n• Space transplants 18-24 inches apart in rows 2-3 feet apart. \n\n• Cabbage prefers full sun and cool weather around 60-70°F. \n\n• Amend soil with compost and side dress with fertilizer during growing season.  \n\n• Add 2-3 inches of mulch to retain moisture and reduce weeds.  \n\n• Irrigate consistently to keep soil moist but avoid wetting leaves.",
      "harvesting_tips": "Cabbage harvesting tips: \n\n• Begin harvesting once heads feel firm and tight when squeezed gently. \n\n• Use a sharp knife to cut heads off just below the lowest leaves. \n\n• Harvest in the morning after dew dries for best flavor and crispness. \n\n• Cutting an X in the top of developing heads will split them for smaller quartered cabbages. \n\n• Store freshly cut cabbage in perforated plastic bags in the fridge for 1-2 weeks.",
      "suggested_weather_to_plant": "Cabbage grows best in cool weather: \n\n• Ideal growing temperatures are 60-70°F during the day and around 50°F at night. \n\n• Grow cabbage in spring and fall in most regions. In warm areas, grow it as a winter crop. \n\n• Cabbage needs consistent moisture and about 1 inch of water per week. \n\n• Avoid hot temperatures over 80°F which causes loose, split heads.",
      "tools_needed_to_plant": "• Sharp knife or pruners for harvesting mature heads. \n\n• Row cover to protect transplants and extend seasons. \n\n• Hand trowel for transplanting seedlings. \n\n• Trellis or stakes if growing tall varieties that require support.",
      "how_to_plant": "How to plant cabbage: \n\n• Start seeds indoors 5-7 weeks before last spring frost. Use grow lights. \n\n• Harden off and transplant 18-24 in. apart after danger of frost has passed. \n\n• Side dress with balanced organic fertilizer when heads begin developing.  \n\n• Add 2-3 inches of mulch around plants to retain moisture and reduce weeds. \n\n• Harvest cabbage once heads become firm and tight when squeezed gently.",
      "fertilizer_to_use": "Good organic fertilizers for cabbage:  \n\n• Compost and aged manure before planting for overall soil nutrition. \n\n• Balanced organic fertilizer to side dress plants during growing season. \n\n• Fish emulsion, alfalfa meal, kelp meal provide nitrogen for growth."
    },
    {
      "id": "10",
      "name": "Broccoli (Broccoli)",
      "pronunciation": "brok-uh-lee",
      "family": "Brassicaceae",
      "genus": "Brassica",
      "scientific_name": "Brassica oleracea var. italica",
      "description": "Broccoli is a cool weather vegetable grown for its edible green florets and stalks. It is packed with vitamins C, K, A, B6, and folate as well as fiber, antioxidants and anti-cancer compounds. Broccoli is a member of the cabbage family and comes in green and purple varieties. It produces clusters of tight flower buds on top of 3-4 foot stalks. Broccoli prefers full sun and fertile soil with plenty of organic matter. It can be eaten raw or cooked.",
      "image": "https://static.vecteezy.com/system/resources/previews/025/064/813/large_2x/broccoli-with-ai-generated-free-png.png",
      "planting_tips": "Tips for planting broccoli: \n\n• Start seeds indoors 5-7 weeks before last frost. Harden off and transplant outside after danger of frost has passed. \n\n• Space transplants 18-24 inches apart in rows spaced 2-3 feet apart.  \n\n• Broccoli needs full sun and consistently moist, fertile soil enriched with compost. \n\n• Use row covers at planting to boost growth and keep pests away. \n\n• Side dress with organic fertilizer once heads start developing.",
      "harvesting_tips": "Broccoli harvesting tips:   \n\n• Begin harvesting the central head when the buds are tight and firm before flowers open. \n\n• Use a sharp knife to cut main stalk about 6 inches down below head. \n\n• Harvest side shoots that continue to develop later for extended harvest. \n\n• Cut in the morning after dew dries for best flavor.  \n\n• Store freshly cut broccoli in plastic bags in the fridge for up to 1 week.",
      "suggested_weather_to_plant": "Ideal weather conditions for broccoli: \n\n• Cool temperatures between 60-70°F during the day and around 50°F at night. \n\n• Grow as a spring or fall crop. Avoid summer heat. \n\n• Plant early spring so heads mature before heat arrives. \n\n• Full sun is required, at least 6 hours of direct sunlight per day. \n\n• Consistent soil moisture. Lack of water causes tough, bitter heads.",
      "tools_needed_to_plant": "• Sharp knife or pruners for harvesting central heads and side shoots. \n\n• Row covers to protect seedlings and extend season. \n\n• Tomato cages or stakes for support if growing a tall variety.",
      "how_to_plant": "How to plant broccoli: \n\n• Start seeds indoors 5-7 weeks before last spring frost. Use grow lights. \n\n• Harden off and transplant 18-24 inches apart after danger of frost has passed. \n\n• Side dress with organic fertilizer when heads start developing. \n\n• Cover transplants with row cover for enhanced growth and pest protection. \n\n• Harvest central heads when buds become tight and firm using a sharp knife.",
      "fertilizer_to_use": "Good organic fertilizer options for broccoli include: \n\n• Compost and aged manure to prepare soil before planting. \n\n• Balanced organic fertilizer to side dress when heads begin developing.  \n\n• Fish emulsion, blood meal, alfalfa meal to provide nitrogen."
    },
    {
      "id": "11",
      "name": "Spinach (Espinaca)",
      "pronunciation": "spin-ich",
      "family": "Amaranthaceae",
      "genus": "Spinacia",
      "scientific_name": "Spinacia oleracea",
      "description": "Spinach is a fast growing leafy green vegetable that thrives in cool weather. It is loaded with nutrients including vitamins A, C, K, folate, manganese and iron. Spinach leaves come in smooth, crinkly or prickly varieties that range from deep green to dark red-purple. It has a mild, slightly earthy taste that works raw in salads or cooked in various dishes and sides. Spinach grows best in fertile soil with consistent moisture and temperatures between 50-75°F.",
      "image": "https://pngimg.com/uploads/spinach/spinach_PNG64.png",
      "planting_tips": "Spinach planting tips: \n\n• Direct sow seeds in early spring and fall when soil temps are cool. \n\n• Plant 1/2 inch deep and 1 inch apart in rows with at least 6 inches between rows.  \n\n• Prepare soil by mixing in several inches of compost to fertilize and improve drainage. \n\n• Keep soil consistently moist. Add mulch around plants to retain moisture. \n\n• Use row covers at seeding to prevent insect pests and enhance germination.",
      "harvesting_tips": "Harvesting spinach: \n\n• Pick outer leaves once they reach 4-6 inches long. \n\n• Use scissors to cut leaves off at base, leaving smaller inner leaves to continue growing. \n\n• Harvest spinach in early morning when leaves are crispest. \n\n• Gently wash leaves and spin or pat dry before storing in the fridge. \n\n• Allow some plants to bolt and go to seed for harvesting spinach seeds.",
      "suggested_weather_to_plant": "Ideal weather for growing spinach: \n\n• Cool temperatures between 50-75°F. \n\n• Grow as a spring and fall crop. Hot temps cause bolting. \n\n• Requires consistent soil moisture. Lack of water causes bitter leaves. \n\n• Full sun early on, then benefits from partial shade in summer. \n\n• Shelter from strong winds which can damage delicate leaves.",
      "tools_needed_to_plant": "• Sharp kitchen scissors for harvesting individual leaves. \n\n• Row covers to protect plants from pests and frosts. \n\n• Dark containers for blanching and sweetening fall harvested leaves.",
      "how_to_plant": "How to plant spinach: \n\n• Direct sow seeds 1/2 inch deep and 1 inch apart in rows 6 inches apart as soon as soil can be worked in spring. \n\n• Cover seeded rows with fabric row covers to retain moisture and prevent pests. \n\n• Use kitchen scissors to selectively harvest outer leaves when they reach 4-6 inches tall. \n\n• Allow some plants to bolt and go to seed for harvesting spinach seeds.",
      "fertilizer_to_use": "Good organic fertilizers for spinach: \n\n• Compost, manure, or leaf mold provide soil nutrition. \n\n• Balanced organic fertilizer or nitrogen sources like blood meal to prevent bolting. \n\n• Fish emulsion side dressed monthly provides a nitrogen boost."
    },
    {
      "id": "12",
      "name": "Sweet Potato (Kamote)",
      "pronunciation": "sweet puh-tey-toh",
      "family": "Convolvulaceae",
      "genus": "Ipomoea",
      "scientific_name": "Ipomoea batatas",
      "description": "Sweet potatoes are heat loving root vegetables grown for their sweet, starchy tubers. They are an excellent source of vitamins A and C, potassium, magnesium and fiber. Sweet potato vines produce edible leaves and shoots along with the underground tubers. Varieties range from pale yellow to orange, red, purple or brown skin and flesh colors. Sweet potatoes do best in loose, well-draining soil and hot, humid growing conditions.",
      "image": "https://www.pngkit.com/png/full/933-9339157_sweet-potato.png",
      "planting_tips": "Tips for planting sweet potatoes:   \n\n• Use disease-free slips or cuttings to plant after danger of frost has passed. \n\n• Space plants 12-18 inches apart in rows 3-4 feet apart in a sunny location. \n\n• Build up long raised beds and plant slips deep leaving just a few leaves showing. \n\n• Keep soil consistently moist. Avoid wet foliage which can promote disease. \n\n• Apply a thick mulch layer to retain moisture, reduce weeds and prevent tubers from greening.",
      "harvesting_tips": "Sweet potato harvesting tips: \n\n• Dig carefully 3-4 months after planting once leaves and vines start dying back. \n\n• Use a garden fork or shovel to lift plants. Gently remove tubes taking care not to bruise. \n\n• Allow to cure for 5-7 days in a warm, humid location to sweeten flavor and toughen skins. \n\n• Store cured sweet potatoes in a cool, dark place. High humidity is ideal for long term storage.",
      "suggested_weather_to_plant": "Ideal conditions for growing sweet potatoes: \n\n• Warm weather with temperatures of 80-85°F during the day and around 70°F at night. \n\n• Plant slips or cuttings after the last spring frost when soil has warmed. \n\n• Full sun is required. Provide at least 8 hours of direct hot sunlight per day. \n\n• Loamy, well-draining soil. Heavy clay results in deformed potatoes. \n\n• High humidity levels. Maintain even soil moisture.",
      "tools_needed_to_plant": "• Sturdy shovel for building long raised beds. \n\n• Garden fork for gently lifting plants when harvesting potatoes. \n\n• Mesh bags for curing harvested sweet potatoes before storage.",
      "how_to_plant": "How to plant sweet potatoes:   \n\n• Build raised beds in full sun amended with compost. \n\n• Plant slips or cuttings 12-18 inches apart, deep enough to leave 2-3 leaves. \n\n• Keep soil consistently moist. Avoid wetting leaves. \n\n• Mulch plants to retain moisture and prevent weeds. \n\n• Dig carefully with a garden fork 3-4 months after planting.",
      "fertilizer_to_use": "Good organic fertilizers for sweet potatoes: \n\n• Compost mixed thoroughly into soil before planting. \n\n• Worm castings side dressed monthly to provide micronutrients. \n\n• Wood ash sprinkled around plants every 4-6 weeks for potassium."
    },
    {
      "id": "13",
      "name": "Radish (Labanos)",
      "pronunciation": "rad-ish",
      "family": "Brassicaceae",
      "genus": "Raphanus",
      "scientific_name": "Raphanus sativus",
      "description": "Radishes are fast maturing, spicy root vegetables with edible tops. They come in many sizes, shapes and colors though most commonly red. Radishes have a sweet, peppery flavor and crunchy texture when harvested young. They contain antioxidants along with vitamin C, potassium and folate. Radishes grow best with cool air temperatures and perform well as a fast early spring or fall crop in most climates.",
      "image": "https://organicdudhauli.org.np/storage/products/icOliKBbmGJn2RfnH4QeKfQ2i.png",
      "planting_tips": "Tips for planting radishes: \n\n• Direct sow seeds outdoors 2-4 weeks before last spring frost.  \n\n• Plant seeds 1/2 inch deep and 1 inch apart in rows 6-12 inches apart. \n\n• Loose, fertile soil amended with compost gives the best shaped roots. \n\n• Keep soil moist for fast growth. Radishes are ready to harvest in 3-4 weeks. \n\n• Interplant radishes with slower growing veggies to maximize space.",
      "harvesting_tips": "Radish harvesting tips: \n\n• Begin harvesting radishes once roots reach golf ball size. \n\n• Grasp tops and pull up gently to remove whole plant. Avoid damaging roots. \n\n• Remove foliage, leaving about an inch of stem attached to root. \n\n• Rinse off dirt and pat dry. Trim off slender side roots. \n\n• Use care not to over mature. Radishes become woody and too spicy if left to grow too large.",
      "suggested_weather_to_plant": "Ideal weather for growing radishes includes: \n\n• Cool air temps between 50-65°F. Avoid extreme heat or cold. \n\n• Plant in early spring and fall in most climates. \n\n• Grow radishes in partial shade in warm summer regions. \n\n• Moist, loose soil. Dry conditions result in overly spicy hot radishes.",
      "tools_needed_to_plant": "• Row covers to protect seedlings and enhance growth. \n\n• Garden fork for loosening soil if compacted. \n\n• Small containers for harvesting and rinsing radishes.",
      "how_to_plant": "How to plant radishes: \n\n• Prepare soil by mixing in several inches of compost. Radishes need loose soil. \n\n• Direct sow seeds 1/2 inch deep and 1 inch apart in rows 6 inches apart. \n\n• Cover seeded rows with fabric row covers to retain moisture and prevent pests. \n\n• Keep soil consistently moist for fast growth. \n\n• Begin harvesting roots when they reach golf ball size in 3-4 weeks.",
      "fertilizer_to_use": "Good organic fertilizers for radishes: \n\n• Compost worked into soil before planting to fertilize and loosen. \n\n• Fish emulsion or compost tea every 3-4 weeks provides nitrogen for foliage growth."
    },
    {
      "id": "14",
      "name": "Beet (Remolacha)",
      "pronunciation": "beet",
      "family": "Amaranthaceae",
      "genus": "Beta",
      "scientific_name": "Beta vulgaris",
      "description": "Beets are a hardy, cool season root vegetable grown for their sweet, earthy flavor and nutritious greens. The round, bulbous roots have deep ruby red interior flesh and come in a range of hues from red to golden. Beet greens are edible and tasty when young and tender. Beets are packed with folate, manganese, potassium, and powerful antioxidants known as betalains which give beets their rich color. Beets prefer cooler temperatures and grow best when planted in early spring or fall.",
      "image": "https://i.pinimg.com/originals/bc/4f/fd/bc4ffd85e00ce47099bb3cd08b956109.png",
      "planting_tips": "Tips for planting beets: \n\n• Direct sow beet seeds outdoors 3-5 weeks before the last spring frost date. \n\n• Prepare soil by mixing in compost to provide nutrients. Loose, well-draining soil is important. \n\n• Sow seeds 1/2 inch deep and 1-2 inches apart in rows 12-18 inches apart. Thin seedlings. \n\n• Keep soil consistently moist for fast growth. Irrigate if rains are lacking. \n\n• Use floating row covers at seeding to enhance germination rates.",
      "harvesting_tips": "Beet harvesting tips: \n\n• Begin harvesting beets once roots reach golf ball size up to full maturity. \n\n• Carefully dig up roots using a garden fork. Avoid bruising or damaging. \n\n• Cut off leafy tops, leaving 2 inches of stem. Reserve young, tender greens for eating. \n\n• Rinse off excess dirt using a gentle spray. Pat dry before storing. \n\n• Keep beet roots and greens separate. Store roots in the crisper, greens loosely wrapped.",
      "suggested_weather_to_plant": "Beets grow best in cool weather: \n\n• Ideal growing temperatures are 60-65°F during the day and around 50°F at night. \n\n• Plant seeds in early spring 2-3 weeks before last frost. Can plant again in late summer for fall crop. \n\n• Full sun to partial shade. Minimum 6 hours of sunlight needed. \n\n• Moist, fertile, well-draining soil high in organic matter. Loose soil prevents malformed roots.",
      "tools_needed_to_plant": "• Garden fork for gently loosening soil and digging up mature roots. \n\n• Floating row covers to enhance germination and protect seedlings. \n\n• Small containers for harvesting and rinsing freshly dug beet roots.",
      "how_to_plant": "How to plant beets: \n\n• Several weeks before planting, enrich soil with aged compost. Beets need loose, fertile soil. \n\n• Direct sow seeds 1/2 inch deep and 1-2 inches apart in rows 12 inches apart. \n\n• Cover seeded rows with floating row covers to retain moisture and prevent pests. \n\n• Keep soil consistently moist. Thin seedlings to 2 inches apart. \n\n• Gently dig up roots when they reach desired size. Cut off greens and rinse before storing.",
      "fertilizer_to_use": "Good organic fertilizers for beets include: \n\n• Compost tilled into soil before planting to fertilize and improve drainage. \n\n• Balanced organic fertilizer that includes boron, which beets need. \n\n• Fish emulsion or compost tea every 3-4 weeks to provide nitrogen."
    },
    {
      "id": "15",
      "name": "Bell Pepper (Paminta)",
      "pronunciation": "bel pep-er",
      "family": "Solanaceae",
      "genus": "Capsicum",
      "scientific_name": "Capsicum annuum",
      "description": "Bell peppers are a warm season vegetable grown for their sweet, crunchy fruits. Also called sweet or capsicum peppers, they are found in a rainbow of colors including green, red, orange, yellow, purple, brown and even black. Bell peppers can be eaten raw, cooked, roasted, stuffed or dried. They provide vitamin C, beta carotene, antioxidants and anti-inflammatory benefits. Peppers grow on bushy plants that need warm weather, full sun exposure and well-draining fertile soil.",
      "image": "https://purepng.com/public/uploads/large/purepng.com-red-pepperpepperpeppercornsspicecapsicumfoodchilired-pepper-1701527271904c16fq.png",
      "planting_tips": "Tips for planting bell peppers: \n\n• Start seeds indoors 6-8 weeks before last spring frost. Use grow lights and heating mats. \n\n• Harden off and transplant seedlings 18-24 inches apart outdoors after danger of frost. \n\n• Choose a sunny spot with nutrient rich, well-draining soil. Amend with compost. \n\n• Use fabric row covers at planting to enhance growth and prevent insect pests. \n\n• Add mulch around plants to retain moisture and reduce weeds.",
      "harvesting_tips": "Bell pepper harvesting tips: \n\n• Begin picking peppers when they reach desired size and color but are still firm. \n\n• Use pruners or a knife to snip peppers off at the stem without damaging plant. \n\n• Handle peppers gently by their stems, not the bodies, to avoid bruising. \n\n• Check plants often and harvest frequently to encourage production. \n\n• Leave unripe green peppers on plant longer to develop full color.",
      "suggested_weather_to_plant": "Bell peppers grow best with: \n\n• Warm weather and temperatures between 70-85°F. \n\n• Full sun exposure. Peppers need at least 6-8 hours of hot sunlight daily. \n\n• Well-drained, fertile soil with added organic matter. \n\n• Low humidity and dry conditions. Prevent fungal and bacterial diseases.",
      "tools_needed_to_plant": "• Row covers to enhance growth and protect from pests. \n\n• Tomato cages or trellises for supporting bushy plants. \n\n• Sharp bypass pruners for harvesting fruits without damage.",
      "how_to_plant": "How to plant bell peppers: \n\n• Start seeds indoors 6-8 weeks before outdoor planting date. Use grow lights. \n\n• Harden off and transplant outdoors 18-24 inches apart after danger of frost has passed. \n\n• Enrich soil with compost and aged manure before planting. \n\n• Use fabric row covers at seeding to boost growth and deter pests. \n\n• Side dress with organic fertilizer when fruits start developing.",
      "fertilizer_to_use": "Good organic fertilizer options for peppers: \n\n• Compost before planting for overall soil enrichment. \n\n• Fish emulsion, blood meal, alfalfa meal provide nitrogen needed for growth. \n\n• Calcium sources like eggshells prevent blossom end rot."
    },
    {
      "id": "16",
      "name": "Pumpkin (Kalabasa)",
      "pronunciation": "puhm(p)-kin",
      "family": "Cucurbitaceae",
      "genus": "Cucurbita",
      "scientific_name": "Cucurbita pepo",
      "description": "Pumpkins are a nutritious, edible fruit in the squash family grown for decoration and eating. They come in a range of sizes, shapes, colors and flavors. Miniature pumpkins are ideal for ornamental use. Medium to large varieties like sugar, cheese and heirloom pumpkins are tastier for cooking, carving into jack-o-lanterns, and using in pies, soups and breads. Pumpkins thrive in full sun and need plenty of space in the garden. They spread on long vines running 10 feet or more along the ground.",
      "image": "https://pngimg.com/uploads/pumpkin/pumpkin_PNG9378.png",
      "planting_tips": "Pumpkin planting tips: \n\n• Start seeds indoors 3-4 weeks before last spring frost. Harden off and transplant outside after danger of frost. \n\n• Plant in full sun with fertile, well-draining soil. Space 3-6 feet apart in rows 5-10 feet apart. \n\n• Add supports like trellises for vining varieties. Allow ample space for vines to spread. \n\n• Mulch around plants to retain moisture and prevent weeds. \n\n• Irrigate consistently, especially after fruit set. Avoid wetting leaves.",
      "harvesting_tips": "Tips for harvesting pumpkins: \n\n• Harvest pumpkins when rinds harden and colors deepen once vines die back. \n\n• Use pruners or a sharp knife to cut fruits from vines, leaving 3-4 inches of stem attached. \n\n• Handle pumpkins by their stems, not bodies which bruises easily. \n\n• Cure for 7-10 days in warm, dry conditions to toughen rinds for long term storage. \n\n• Wash pumpkins gently with mild soap and dry thoroughly before storage or decorating.",
      "suggested_weather_to_plant": "Ideal conditions for growing pumpkins include: \n\n• Warm weather with temperatures between 65-75°F during the day and around 50°F at night. \n\n• Full sun exposure. Pumpkins require at least 8 hours of direct hot sunlight daily. \n\n• Plant seeds or starter plants after danger of frost when soil warms above 60°F. \n\n• Well-drained, nutrient rich soil. Heavy clay causes poorly shaped pumpkins.",
      "tools_needed_to_plant": "• Strong trellises or support structures for vine growth and heavy fruits. \n\n• Garden scissors or pruners for harvesting pumpkins from vines. \n\n• Large containers for curing freshly picked pumpkins before storage.",
      "how_to_plant": "How to plant pumpkins: \n\n• Start seeds indoors 3-4 weeks before outdoor planting date. Use grow lights. \n\n• Transplant starter plants outside when soil reaches 60°F. Space 3-6 feet apart in rows 5-10 feet apart. \n\n• Add trellises or fencing for vines to spread on. Leave ample space between plants. \n\n• Fertilize vines monthly with compost tea once fruits being forming. \n\n• Harvest fully colored mature pumpkins once vines start dying back.",
      "fertilizer_to_use": "Good organic fertilizers for pumpkins include: \n\n• Compost and aged manure mixed into soil to fertilize before planting. \n\n• Balanced organic granular fertilizer to support overall growth. \n\n• Compost tea, fish emulsion or kelp meal to provide extra nitrogen once fruits form."
    },
    {
      "id": "17",
      "name": "Green Beans (Sitaw)",
      "pronunciation": "green beenz",
      "family": "Fabaceae",
      "genus": "Phaseolus",
      "scientific_name": "Phaseolus vulgaris",
      "description": "Green beans are a warm season vegetable grown for their crisp, tender pods. Also called snap or string beans, varieties come in bush and pole types. Green beans are rich in chlorophyll, vitamins C and K, provide fiber and offer antioxidant benefits. They have a sweet, grassy flavor. Green beans grow on vining plants that produce slender pods in an array of colors including green, purple, yellow, streaked and mottled. They require full sun and fertile soil.",
      "image": "https://pngimg.com/uploads/green_bean/green_bean_PNG14.png",
      "planting_tips": "Tips for planting green beans: \n\n• Direct sow beans 1 inch deep and 2-4 inches apart in rows 18-36 inches apart after danger of frost. \n\n• Choose a sunny spot with well-draining fertile soil. Amend with compost before planting.\n\n• Bush varieties do not require trellising. Provide poles and trellises for pole bean varieties to climb. \n\n• Mulch around plants to retain moisture and prevent weeds. \n\n• Irrigate consistently to keep soil evenly moist.",
      "harvesting_tips": "Green bean harvesting tips: \n\n• Begin picking beans when pods are slender, crisp and snap easily. Check plants daily. \n\n• Gently snap off pods at stem end. Avoid pulling to prevent plant damage. \n\n• Harvest beans early and often, every 2-3 days, to encourage more pod production. \n\n• Store freshly picked beans in perforated plastic bags in refrigerator for up to 1 week.",
      "suggested_weather_to_plant": "Ideal weather conditions for growing green beans are: \n\n• Warm weather with daytime temps of 70-85°F and nighttime temps above 60°F. \n\n• Plant seeds directly in garden 2 weeks after last expected spring frost. \n\n• Full sun exposure, minimum 6-8 hours of hot sunlight daily. \n\n• Consistent moisture. Insufficient water results in tough, stringy beans.",
      "tools_needed_to_plant": "• Trellises, poles, nets, fencing for climbing varieties. \n\n• Fabric row covers to protect seedlings and deter pests. \n\n• Small containers for collecting beans at harvest.",
      "how_to_plant": "How to plant green beans: \n\n• Prepare soil by mixing in aged compost or manure before planting. \n\n• Plant bean seeds 1 inch deep, 2-4 inches apart in rows 18-36 inches apart after danger of frost. \n\n• Provide trellises and supports for vining varieties. \n\n• Side dress growing plants with organic fertilizer. \n\n• Pick beans regularly when pods are young, slender and snap easily.",
      "fertilizer_to_use": "Good organic fertilizers for green beans include: \n\n• Compost before planting to enrich soil nutrients. \n\n• Fish emulsion side dressed monthly provides nitrogen. \n\n• Compost tea every 2-3 weeks gives beneficial microbes."
    },
    {
      "id": "18",
      "name": "Peas (Pisang)",
      "pronunciation": "peez",
      "family": "Fabaceae",
      "genus": "Pisum",
      "scientific_name": "Pisum sativum",
      "description": "Peas are a cool weather vegetable that produce pods filled with green, rounded seeds, also called peas. Varieties include shelling, snap and snow peas. Peas offer vitamins C, K and folate along with fiber, antioxidants and anti-inflammatory benefits. They have a sweet, grassy taste. Peas grow on vining plants up to 6 feet tall and do best planted in early spring in well-draining fertile soil.",
      "image": "https://pngimg.com/uploads/pea/pea_PNG24346.png",
      "planting_tips": "Tips for planting peas: \n\n• Direct sow pea seeds outdoors 3-4 weeks before the last frost. \n\n• Prepare soil by mixing in compost. Peas prefer slightly acidic, well-draining soil. \n\n• Plant seeds 1 inch deep and 1-2 inches apart in double rows or wide rows spaced 6 inches apart. \n\n• Provide trellises and supports for vines to climb upwards on. Avoid sprawling growth. \n\n• Use row covers at seeding to enhance germination rates.",
      "harvesting_tips": "Pea harvesting tips: \n\n• Harvest snow and snap peas when pods are plump and bright green. \n\n• Pick shelling peas once pods fill out. Check interiors for plumpness. \n\n• Gently twist pods off vine. Take care not to damage plants and future yield. \n\n• For shelling peas, remove from pods immediately after picking. Discard pods. \n\n• Consume peas as soon as possible, ideally within 1-2 days of harvest for optimal flavor and texture.",
      "suggested_weather_to_plant": "Ideal conditions for growing peas: \n\n• Cool weather, around or below 75°F. Peas thrive best at 60-70°F. \n\n• Plant early spring as soon as soil can be worked. Peas can withstand some frost. \n\n• Full sun is ideal but will tolerate partial shade, especially in summer. \n\n• Well-draining, fertile soil kept consistently moist. Heavy soil causes rot.",
      "tools_needed_to_plant": "• Trellises, fencing, stakes, poles to support climbing vines and keep pods off the ground. \n\n• Row covers to enhance germination rates and protect from frost. \n\n• Small containers for collecting picked peas.",
      "how_to_plant": "How to plant peas: \n\n• Prepare soil by mixing in compost. Peas need fertile, well-draining soil. \n\n• Sow seeds 1 inch deep, 1-2 inches apart in double rows 6 inches apart. \n\n• Add trellises and nets for tendrils to climb up once seedlings emerge. \n\n• Use row covers over seeded rows to retain moisture and prevent pests. \n\n• Pick snow, snap and shelling peas regularly once pods fill out for maximum harvest.",
      "fertilizer_to_use": "Good organic fertilizer options for peas: \n\n• Compost or aged manure provides overall soil enrichment before planting. \n\n• Fish emulsion side dressed monthly offers a nitrogen boost for growth. \n\n• Compost tea every 3 weeks gives beneficial microbes and micronutrients."
    },
    {
      "id": "19",
      "name": "Asparagus (Asparagus)",
      "pronunciation": "as-pair-uh-guhs",
      "family": "Asparagaceae",
      "genus": "Asparagus",
      "scientific_name": "Asparagus officinalis",
      "description": "Asparagus is a perennial vegetable grown for its succulent, edible young spears. It emerges each spring from crown roots established the previous year. White, green and purple varieties exist. Asparagus is packed with nutrients including folate, vitamins A, C, E and K. It has a delicate, sweet grassy flavor when harvested and cooked promptly. Asparagus needs well-draining soil and takes 2-3 years from seeding to establish before producing a full yield.",
      "image": "https://freepngimg.com/download/green/131907-asparagus-bundle-free-png-hq.png",
      "planting_tips": "• Purchase 1 year old crowns or start seeds indoors 14-18 weeks before outdoor planting date. \n\n• Prepare growing beds by mixing aged manure or compost into the soil. Asparagus needs well-drained, fertile soil. \n\n• Dig trenches 6-8 inches deep. Space crowns 12-18 inches apart in rows spaced 3-4 feet apart. Cover with 2-3 inches of soil. \n\n• Gradually fill trenches as spears grow over the first two seasons. Do not harvest the first year. \n\n• Mulch plants to retain moisture and control weeds. Irrigate regularly ensuring good drainage.",
      "harvesting_tips": "• Harvest asparagus spears the second spring after planting when they are 6-8 inches tall by snapping or cutting spears at ground level. \n\n• Harvest spears every 2-3 days during the peak season, approximately 6-8 weeks. \n\n• Stop harvesting when spears become spindly. Allow ferns to develop to nourish roots for next year's crop. \n\n• Cut spears in the morning for best flavor and tenderness. Rinse gently before cooking. \n\n• For optimal freshness and taste, cook asparagus on the same day as harvesting.",
      "suggested_weather_to_plant": "• Plant asparagus crowns or seeds when soil temperatures are above 50°F. \n\n• Select a sunny location sheltered from strong winds. Asparagus needs at least 6 hours of sunlight. \n\n• Asparagus will tolerate frost but prefers a frost-free period when actively growing in spring and summer. \n\n• Spears tolerate temperatures down to freezing 32°F but optimal growth occurs between 70-80°F. \n\n• Consistent moisture is vital, especially when establishing. Water regularly if rainfall is lacking.",
      "tools_needed_to_plant": "• Garden fork or shovel for preparing soil beds \n\n• Hand trowel for transplanting seedlings \n\n• Garden knife for harvesting spears \n\n• Tarps for covering beds during establishment years \n\n• Mulch for moisture retention and weed control",
      "how_to_plant": "• Select a permanent sunny spot with well-drained fertile soil. Dig in aged compost or manure. \n\n• For seeds, start indoors 14-18 weeks before outdoor planting date. Transplant seedlings into trenches. \n\n• For crowns, dig trenches 6-8 inches deep. Space crowns 12-18 inches apart and cover with 2-3 inches soil. \n\n• Gradually fill trenches as shoots emerge over first two years. Don't harvest the first season. \n\n• Harvest spears when 6-8 inches tall by snapping at ground level during following springs.",
      "fertilizer_to_use": "• Compost and aged manure provides a complete nutritional boost before planting. \n\n• Balanced organic fertilizer like 10-10-10 applied in early spring supplies key nutrients. \n\n• Fish emulsion or kelp meal every 4-6 weeks during spearing season gives a nitrogen boost."
    },
    {
      "id": "20",
      "name": "Leek (Onion Leaf)",
      "pronunciation": "leek",
      "family": "Amaryllidaceae",
      "genus": "Allium",
      "scientific_name": "Allium ampeloprasum",
      "description": "Leeks are vegetable crops grown for their edible stalks and mild, onion-like flavor. They have elongated, cylindrical white shanks extending from the base to green, flat leaves. Leeks contain antioxidants, vitamin K, folate, manganese and fiber. Their sweet, subtle taste works well cooked or raw in soups, stews, savory pies and more. Leeks prefer cool weather and grow best as a fall crop in deep, fertile soil.",
      "image": "https://pngimg.com/d/leek_PNG66.png",
      "planting_tips": "• Start seeds indoors 8-10 weeks before outdoor planting date or purchase transplants. \n\n• Prepare soil by mixing in compost to fertilize and improve drainage. Leeks need loose, fertile soil. \n\n• Transplant seedlings 4-6 inches deep and 4-6 inches apart in rows spaced 15 inches apart. \n\n• As plants grow, hill up soil or add mulch around shanks to blanch stems for tenderness and mild sweetness. \n\n• Keep soil moist with weekly watering. Irrigate deeply, avoiding wetting foliage.",
      "harvesting_tips": "• Begin harvesting leeks when stalks reach 1-2 inches in diameter. Carefully dig up using a garden fork. \n\n• Loosen soil first then pull up plants by the leaves, not the stems which can damage them. \n\n• Clean leeks by trimming roots and dark leaves. Slice leeks lengthwise and rinse well between layers to remove dirt. \n\n• Prepare leeks for cooking promptly after harvesting for best texture and flavor. \n\n• Store unwashed leeks in the refrigerator in plastic bags for up to 2 weeks.",
      "suggested_weather_to_plant": "• Grow leeks as a fall crop. They tolerate light frosts after maturing. \n\n• Start seeds indoors for early summer planting or set out transplants in late summer. \n\n• Leeks prefer cool temperatures between 60–70°F for optimal growth. \n\n• Full sun to partial shade. Minimum 6 hours sunlight needed. \n\n• Moisture retentive, fertile soil high in organic matter. Mulch to retain moisture.",
      "tools_needed_to_plant": "• Garden spade for preparing soil beds.\n\n• Hand trowel for transplanting seedlings.\n\n• Garden fork for gently lifting mature plants.\n\n• Mulch for hilling up soil around plants as they grow.",
      "how_to_plant": "• Enrich soil with compost before planting. Leeks need fertile, well-draining soil. \n\n• Start seeds indoors or set out transplants 4-6 inches apart in trenches 4-6 inches deep. \n\n• Gradually hill up soil or mulch as plants grow to blanch stems. \n\n• Maintain consistent moisture through irrigation if rainfall lacks. \n\n• Dig up mature leeks carefully with a garden fork. Cut roots and dark leaves before rinsing well.",
      "fertilizer_to_use": "• Compost or aged manure provides overall soil enrichment before planting. \n\n• Balanced organic fertilizer to side dress monthly. \n\n• Fish emulsion, blood meal or alfalfa meal for nitrogen."
    },
    {
      "id": "21",
      "name": "Brussels Sprouts (Bruselas)",
      "pronunciation": "bruh-səlz sprouts",
      "family": "Brassicaceae",
      "genus": "Brassica",
      "scientific_name": "Brassica oleracea var. gemmifera",
      "description": "Brussels sprouts are a hardy, cool weather vegetable grown for their miniature cabbage-like buds. They are high in nutrients including vitamins C and K, folate, manganese and fiber. Brussels sprouts have a mildly sweet, earthy flavor when cooked properly. They grow on multi-branched stalks up to 3 feet tall and each sprout forms at the base of large leaves. Brussels sprouts need full sun, fertile soil and cool fall temperatures to properly mature",
      "image": "https://www.pngmart.com/files/15/Brussels-Sprouts-PNG-Photos.png",
      "planting_tips": "• Start seeds indoors 5-6 weeks before transplanting date. Harden off and transplant outside 3-4 weeks before first fall frost. \n\n• Space plants 18-24 inches apart in rows spaced 3 feet apart. Brussels sprouts need good air circulation. \n\n• Enrich soil with compost before planting. Side dress with organic fertilizer monthly. \n\n• Add 2-3 inches of mulch to help retain moisture and reduce weeds. \n\n• Irrigate evenly to keep soil consistently moist but avoid wetting foliage.",
      "harvesting_tips": "• Begin harvesting sprouts from the bottom up when they reach about 1 inch diameter. \n\n• Twist or cut sprouts off the stalk with a sharp knife. Leave lower leaves intact to continue feeding the plant. \n\n• Harvest sprouts every few days during peak season. Pick before temperatures drop below 20°F. \n\n• Remove any damaged, yellowed sprouts promptly as they develop. Don't wash before storing. \n\n• Store unwashed sprouts in plastic bags in the refrigerator crisper drawer.",
      "suggested_weather_to_plant": "• Grow Brussels sprouts as a fall crop. They thrive in cool weather. \n\n• Transplant seedlings outdoors 3-4 weeks before the first expected autumn frost date. \n\n• Brussels sprouts grow best with temperatures around 60-70°F during the day and around 45-55°F at night. \n\n• They perform well with light fall frosts but stop producing once hard frosts begin. \n\n• Brussels sprouts require full sun, at least 6 hours of direct sunlight daily.",
      "tools_needed_to_plant": "• Sharp knife or pruners for harvesting sprouts. \n\n• Garden shears for removing yellowed leaves or damaged sprouts. \n\n• Stakes for staking tall varieties that become top heavy.",
      "how_to_plant": "• Start seeds indoors 5-6 weeks before outdoor planting date. Use grow lights. \n\n• Transplant seedlings when 3-4 weeks of cool fall weather remains. Space 18-24 inches apart in rows 3 feet apart. \n\n• Side dress monthly with balanced organic fertilizer when sprouts begin forming. \n\n• Add 2-3 inches of mulch around plants to retain moisture and reduce weeds. \n\n• Harvest sprouts when they reach 1 inch diameter by gently twisting off stalks.",
      "fertilizer_to_use": "• Aged compost or manure provides overall soil enrichment before planting. \n\n• Balanced organic granular fertilizer provides steady nutrients. \n\n• Fish emulsion or kelp extract offers a nitrogen boost when sprouts form."
    },
    {
      "id": "22",
      "name": "Parsnip (Labanos)",
      "pronunciation": "pars-nip",
      "family": "Apiaceae",
      "genus": "Pastinaca",
      "scientific_name": "Pastinaca sativa",
      "description": "Parsnips are cool weather root vegetables related to carrots with creamy white tapered roots and edible leaves. They have a sweet, nutty flavor. Parsnips are high in fiber, folate, potassium and vitamins C and E. They can be roasted, pureed into soups or stews, fried into chips and more. Parsnips take longer to mature than carrots, around 3-4 months. They prefer loose, fertile soil and temperatures below 70°F.",
      "image": "https://purepng.com/public/uploads/large/purepng.com-fresh-parsnip-rootvegetablesroot-vegetable-parsnip-941524685943nradf.png",
      "planting_tips": "• Direct sow parsnip seeds outdoors 2-4 weeks before the last spring frost. They take longer to mature than carrots. \n\n• Prepare soil by loosening and mixing in compost which provides nutrients. Parsnips need deep soil. \n\n• Sow seeds 1/2 inch deep, 2 inches apart in rows spaced 12-18 inches apart. Thin seedlings. \n\n• Use row covers at seeding to retain moisture and prevent pests. Keep soil consistently moist for germination.",
      "harvesting_tips": "• Begin harvesting parsnips after a light frost which sweetens the roots. Dig up as needed once roots size up. \n\n• Use a garden fork to gently loosen soil. Pull up roots by the tops, not the root. \n\n• Trim off the tops, leaving 1 inch of stem. Rinse off soil using a gentle spray. Pat dry before storing. \n\n• Parsnips can be kept in plastic bags in the refrigerator for several weeks or left in the ground over winter.",
      "suggested_weather_to_plant": "• Parsnips grow best in cool weather with temperatures below 70°F. \n\n• Direct sow seeds in early spring 2-4 weeks before the last expected frost. \n\n• Choose a sunny spot with at least 6 hours of sunlight. Parsnips can tolerate partial shade. \n\n• Well-drained, loose soil enriched with organic matter provides the best shaped roots. Clay causes misshapen roots.",
      "tools_needed_to_plant": "• Garden fork for aerating soil and digging mature roots. \n\n• Row covers to enhance germination and protect seedlings. \n\n• Gardening gloves for handling prickly leaves when harvesting.",
      "how_to_plant": "• Several weeks before planting, enrich soil by mixing in aged compost or manure. Parsnips need very deep, loose soil. \n\n• Direct sow seeds 1/2 inch deep, 2 inches apart in rows 12-18 inches apart. \n\n• Use row covers over seeded rows to retain moisture and prevent pests. \n\n• Allow roots to size up for 3-4 months. Dig carefully with a garden fork once ready. Trim tops before storing.",
      "fertilizer_to_use": "• Aged compost or manure provides overall soil enrichment before planting. \n\n• Balanced organic fertilizer with extra phosphorus to promote root development. \n\n• Compost tea or fish emulsion every 4 weeks supplies nitrogen."
    },
    {
      "id": "23",
      "name": "Celery (Kintsay)",
      "pronunciation": "sel-uh-ree",
      "family": "Apiaceae",
      "genus": "Apium",
      "scientific_name": "Apium graveolens",
      "description": "Celery is a cool season vegetable grown for its edible stalks, leaves and seeds. Celery has long, ribbed, pale green stalks topped with leaves. It has a clean, aromatic taste that works raw or cooked. Celery is high in antioxidants, potassium, folate and vitamins K and C. Celery performs best started from seed and transplanted. It requires cool temperatures, consistent moisture and protection from hot sun to properly develop.",
      "image": "https://www.pngmart.com/files/16/Organic-Green-Celery-Transparent-PNG.png",
      "planting_tips": "• Start celery seeds indoors 10-12 weeks before outdoor planting date. Celery has a long growing period. \n\n• Transplant seedlings outdoors several weeks before the last expected spring frost date. \n\n• Space plants 4-6 inches apart in rows 18-24 inches apart. Celery needs adequate airflow to prevent disease. \n\n• Gradually hill up soil along sides of stalks to blanch and prevent development of bitterness.",
      "harvesting_tips": "• Begin harvesting celery stalks when they reach desired thickness, usually around 3 months after transplanting. \n\n• Cut off outer stalks with a sharp knife near the base, leaving central stalks to continue growing. \n\n• Harvest celery in early morning for best texture and flavor. Rinse dirt off immediately before storing. \n\n• Keep celery hydrated by placing stalks upright in water in the refrigerator.",
      "suggested_weather_to_plant": "• Celery requires consistently cool temperatures between 60-70°F to grow properly. \n\n• Start seeds indoors for early spring planting outdoors several weeks before last frost. \n\n• Celery needs partial shade, especially in warm climates. After transplanting, shade with boards or fabric. \n\n• Moist soil is essential but avoid wetting foliage which can cause rot. Maintain even moisture.",
      "tools_needed_to_plant": "• Boards, shade cloth, row covers to shade transplants and prevent bolting. \n\n• Stakes and garden ties for hilling up soil along stalks to blanch. \n\n• Sharp knife for harvesting outer stalks.",
      "how_to_plant": "• Start celery seeds indoors 10-12 weeks before outdoor planting date. Use grow lights. \n\n• Transplant seedlings into well-prepared soil several weeks before last spring frost. \n\n• Gradually hill up soil along stalks with boards or fabric to blanch and prevent bitterness. \n\n• Maintain even moisture and protect plants from direct hot sun which causes bolting.",
      "fertilizer_to_use": "• Compost provides overall soil enrichment before planting. \n\n• Balanced organic fertilizer with extra nitrogen to promote lush foliage growth after transplanting. \n\n• Compost tea or fish emulsion every 3-4 weeks gives a nitrogen boost."
    },
    {
      "id": "25",
      "name": "Kale (Kina)",
      "pronunciation": "kayl",
      "family": "Brassicaceae",
      "genus": "Brassica",
      "scientific_name": "Brassica oleracea var. sabellica",
      "description": "Kale is a leafy green vegetable packed with antioxidants, vitamins K, A, C, calcium, potassium, and powerful health-promoting compounds. It comes in green, purple, and ornamental varieties. Kale has ruffled or flat blue-green leaves attached to fibrous stems that are edible and delicious. It has an earthy, mildly sweet flavor. Kale tolerates cold temperatures well, thriving as a fall and winter crop. It provides bountiful harvests into winter months in many regions. Kale stands out for being exceptionally cold hardy and nutritious.",
      "image": "https://www.pngplay.com/wp-content/uploads/10/Kale-Free-PNG.png",
      "planting_tips": "Tips for planting kale: \n\n• Direct sow seeds 1⁄2 inch deep 2-3 weeks before last spring frost or start seeds indoors under grow lights before transplanting. \n\n• Space plants 12-18 inches apart in rows 2-3 feet apart to allow room for growth. Kale grows up to 3 feet wide at maturity.\n\n• Prepare soil by mixing in 2-3 inches of mature compost to provide nutrients. Kale prefers fertile soil. \n\n• Add 2-3 inches of mulch around plants to retain moisture, suppress weeds, and insulate roots in winter. \n\n• Consistent moisture is important, especially for young plants. Water at soil level to avoid wetting leaves which can promote disease.",
      "harvesting_tips": "Kale harvesting tips: \n\n• Begin picking lower leaves when they reach 8 inches or longer. Harvest a few leaves per plant, leaving the growing crown intact.\n\n• Use a sharp knife to cut leaves off just above the stem. Choose outer, older leaves first allowing younger ones to continue growing.\n\n• Harvest in early morning after dew dries for best flavor and texture.\n\n• Rinse leaves gently to remove dirt. Pat dry before storing in plastic bags in the refrigerator for 5-7 days.\n\n• Some varieties can overwinter in cold climates, providing harvests into winter months after frosts begin.",
      "suggested_weather_to_plant": "Ideal weather conditions for growing kale are: \n\n• Cool temperatures, around 60-70°F during the day and 40-50°F at night. Kale can tolerate frost. \n\n• Direct sow in early spring, or in late summer for a fall/winter crop. \n\n• Full sun is best but kale tolerates some shade, especially in hot summer weather. \n\n• Moist, fertile soil high in organic matter. Mulch helps retain moisture. \n\n• Protect from strong winds and hard freezes below 20°F. Use row covers if needed.",
      "tools_needed_to_plant": "• Sharp kitchen knife for harvesting leaves.\n\n• Row covers to protect from cold temperatures and pests.\n\n• Wire hoops and fabric covers to make mini-greenhouses overwintering plants.",
      "how_to_plant": "How to plant kale: \n\n• Direct sow seeds 1/2 inch deep, 2 inches apart, in rows 12-18 inches apart. Or start transplants. \n\n• Space mature plants 12-18 inches apart in rows 2-3 feet apart. Kale needs room to grow. \n\n• Prepare soil by mixing in 2-3 inches of finished compost before planting. Side dress monthly. \n\n• Use row covers over seeds/seedlings to boost growth and deter pests. \n\n• Harvest leaves when they reach 8 inches or more by cutting just above stem with a sharp knife.",
      "fertilizer_to_use": "Good organic fertilizers for kale include:\n\n• Finished compost before planting provides overall soil enrichment.\n\n• Balanced organic fertilizer to side dress monthly.\n\n• Fish emulsion, blood meal, alfalfa meal to provide nitrogen for growth."
    },
    {
      "id": "26",
      "name": "Collard Greens (Pechay)",
      "pronunciation": "kuh-lard greenz",
      "family": "Brassicaceae",
      "genus": "Brassica",
      "scientific_name": "Brassica oleracea var. viridis",
      "description": "Collard greens are a leafy green vegetable closely related to kale and cabbages. They have broad, dark blue-green leaves with creamy white stems. Collards are an excellent source of vitamins A, C, K along with antioxidants, calcium and fiber. They have a mildly bitter, earthy flavor. Collards grow well in cool conditions and can withstand light frost. They are a staple vegetable of southern U.S. cuisine.",
      "image": "https://i.pinimg.com/originals/08/a4/b2/08a4b2ea834ca1ebe78c4ded814795b6.png",
      "planting_tips": "Collard greens planting tips:\n\n• Start seeds indoors 5-6 weeks before last spring frost or direct sow outdoors 3-4 weeks before frost date. \n\n• Space plants 12-18 inches apart in rows 2-3 feet apart. Collards need good airflow to prevent disease. \n\n• Prepare soil by mixing in aged compost or manure before planting. Side dress monthly. \n\n• Add 2-3 inches of mulch around plants to retain moisture and reduce weeds. \n\n• Consistent watering is important, about 1-2 inches per week. Irrigate at soil level.",
      "harvesting_tips": "Collard greens harvesting tips: \n\n• Start picking lower leaves when they reach 8-10 inches long. Harvest a few leaves per plant, leaving smaller interior leaves. \n\n• Use a sharp knife to slice leaves off just above the stem. Choose older outer leaves first. \n\n• Harvest in early morning after dew dries for best texture and flavor. \n\n• Rinse leaves gently right after picking. Pat dry before storing in plastic bags in refrigerator. \n\n• Some plants can overwinter in cold climates, providing harvests well into winter months.",
      "suggested_weather_to_plant": "Ideal conditions for growing collard greens:\n\n• Cool temperatures between 60-75°F. Can withstand light frosts once established. \n\n• Grow as a fall/winter crop. Hot weather causes rapid bolting. \n\n• Full sun to partial shade. More shade in peak summer can prevent bolting. \n\n• Consistently moist, fertile soil high in organic matter. Mulch to retain moisture. \n\n• Protect from hard freezes below 20°F. Use cloches or row covers when needed.",
      "tools_needed_to_plant": "• Sharp kitchen knife for harvesting leaves.\n\n• Garden shears for removing flower stalks.\n\n• Wire hoops and remay fabric to make mini-greenhouses protecting plants.",
      "how_to_plant": "How to grow collard greens: \n\n• Start seeds indoors 5-6 weeks before last frost or direct sow 3-4 weeks before frost date. \n\n• Transplant or thin seedlings to 12-18 inches apart in rows 2-3 feet apart when leaves reach 4 inches. \n\n• Prepare soil by mixing in aged compost or manure before planting. Side dress monthly.\n\n• Add 2-3 inches of mulch to retain moisture and reduce weeds. \n\n• Harvest outer leaves when 8-10 inches long by cutting with a sharp knife above stem.",
      "fertilizer_to_use": "Good organic fertilizers for collards include:\n\n• Compost or aged manure for overall soil enrichment before planting.\n\n• Balanced organic fertilizer to side dress plants monthly.\n\n• Fish emulsion, blood meal, alfalfa meal to provide nitrogen."
    },
    {
      "id": "27",
      "name": "Swiss Chard",
      "pronunciation": "swiss chard",
      "family": "Amaranthaceae",
      "genus": "Beta",
      "scientific_name": "Beta vulgaris subsp. cicla",
      "description": "Swiss chard is a leafy vegetable grown for its tender, colorful stems and leaves. It comes in green, red, yellow, and rainbow stalk varieties. Chard has a slightly bitter, earthy flavor. The leaves contain vitamins K, A, C, E, magnesium, potassium, iron and antioxidants. Both the leaves and stalks are edible and delicious when freshly picked. Chard tolerates heat and cold well, thriving as a spring, summer, and fall crop.",
      "image": "https://purepng.com/public/uploads/large/purepng.com-fresh-swiss-chardvegetablesspinach-leaf-vegetable-swiss-chard-silverbeet-941524685949hf5vs.png",
      "planting_tips": "Swiss chard planting tips: \n\n• Direct sow seeds 1⁄2 inch deep and 1 inch apart in rows 18 inches apart, 2-4 weeks before last spring frost. Or start seeds indoors. \n\n• Thin seedlings to 8 inches apart. Swiss chard needs good airflow to prevent disease. \n\n• Prepare soil by mixing in several inches of compost to fertilize and improve drainage. Side dress monthly. \n\n• Consistent moisture is important, especially for young plants. Water near the roots to avoid wetting leaves. Add mulch to retain moisture.",
      "harvesting_tips": "Harvesting swiss chard: \n\n• Start picking outer leaves when they reach 6-8 inches tall. Harvest 1-2 leaves per plant to allow regrowth.\n\n• Use a sharp knife to cut leaves off just above the crown in a V-shape. Choose larger, older leaves first.\n\n• Pick in early morning for best texture and flavor. Rinse and pat dry leaves before refrigerating. \n\n• Some plants can be overwintered as microgreens, providing early spring leaves. Cut back any flower stalks.",
      "suggested_weather_to_plant": "Ideal conditions for growing swiss chard: \n\n• Air temperatures between 55-75°F. Withstands summer heat better than spinach.\n\n• Full sun to partial shade. Hot afternoon shade prevents bolting in summer.\n\n• Consistently moist, fertile soil high in organic matter. Heavy clay causes stunted growth.\n\n• Tolerant of both cold and heat. Thrives in spring, summer, fall. Protect from hard freezes below 20°F.",
      "tools_needed_to_plant": "• Sharp kitchen knife for harvesting leaves.\n\n• Garden shears for removing flower stalks.\n\n• Row cover to protect seeded rows and mature plants.",
      "how_to_plant": "How to plant swiss chard: \n\n• Direct sow seeds 1/2 inch deep, 1 inch apart in rows 18 inches apart 2-4 weeks before last frost. \n\n• Thin seedlings to 8 inches apart once they reach 3-4 inches tall. Swiss chard needs good airflow. \n\n• Side dress plants monthly with organic fertilizer to promote growth. \n\n• Harvest outer leaves when 6-8 inches tall by cutting with a sharp knife just above crown.",
      "fertilizer_to_use": "Good organic fertilizers for swiss chard include: \n\n• Compost provides overall soil enrichment before planting.\n\n• Balanced organic fertilizer to side dress monthly.\n\n• Liquid fertilizers like fish emulsion, compost tea, kelp extract provide nitrogen."
    },
    {
      "id": "28",
      "name": "Cauliflower (Cauliflower)",
      "pronunciation": "kawl-uh-flow-er",
      "family": "Brassicaceae",
      "genus": "Brassica",
      "scientific_name": "Brassica oleracea var. botrytis",
      "description": "Cauliflower is a cool weather vegetable grown for its edible immature flower heads called curds. White cauliflower is the most common but orange, purple and green varieties exist. Cauliflower is an excellent source of antioxidants, fiber, folate, vitamins C and K. It has a mild, earthy, nutty flavor when cooked. Cauliflower needs consistently cool temperatures, full sun, and fertile soil amended with organic matter to properly grow dense white curds.",
      "image": "https://www.pngmart.com/files/8/Cauliflower-PNG-Image-HD.png",
      "planting_tips": "Cauliflower planting tips: \n\n• Start seeds indoors 4-6 weeks before transplanting date. Harden off and transplant several weeks before the last spring frost. \n\n• Space plants 18-24 inches apart in rows 2-3 feet apart. Cauliflower needs good airflow to prevent fungal disease. \n\n• Enrich soil with 2-3 inches of compost before planting. Side dress with organic fertilizer monthly. \n\n• Blanche developing curds by loosely tying outer leaves over the head when 2 inches in diameter. This protects from sun.",
      "harvesting_tips": "Harvesting cauliflower: \n\n• Harvest heads when they reach full size, are compact, white and smooth, before small flower buds loosen and open. \n\n• Use a sharp knife to cut the head from the plant, leaving 4-6 wrapper leaves attached to protect it. \n\n• Harvest in the cool morning for best flavor, when heads are firmest. \n\n• Store whole heads in perforated plastic bags in the refrigerator crisper for 1 week.",
      "suggested_weather_to_plant": "Ideal conditions for growing cauliflower: \n\n• Consistently cool temperatures between 60-70°F and 40-50°F at night. \n\n• Grow for spring and fall harvest, avoiding summer heat. \n\n• Full sun exposure needed. After transplanting, protect from direct sun with shade cloth. \n\n• Moist, fertile soil high in organic matter. Mulch helps retain moisture.",
      "tools_needed_to_plant": "• Stakes and garden ties for blanching developing heads.\n\n• Sharp knife for harvesting fully formed heads.\n\n• Shade cloth or boards for shading plants after transplanting.",
      "how_to_plant": "How to grow cauliflower: \n\n• Start seeds indoors 4-6 weeks before transplanting date. Use grow lights. \n\n• Set transplants 18-24 inches apart, 2-3 feet between rows. Side dress monthly. \n\n• When heads begin forming, loosely tie outer leaves over the curd to blanch. \n\n• Maintain even soil moisture. Avoid wetting leaves which causes disease. \n\n• Harvest fully formed, compact heads before flower buds open using a sharp knife.",
      "fertilizer_to_use": "Good organic fertilizers for cauliflower include: \n\n• Compost provides overall soil enrichment before planting. \n\n• Balanced organic fertilizer to side dress monthly. \n\n• Fish emulsion, blood meal, alfalfa meal provide nitrogen."
    },
    {
      "id": "24",
      "name": "Bok Choy (Bok Choy)",
      "pronunciation": "bahk choy",
      "family": "Brassicaceae",
      "genus": "Brassica",
      "scientific_name": "Brassica rapa subsp. chinensis",
      "description": "Bok choy, also called pak choi, is a leafy vegetable with thick white stalks and dark green leaves. It has a mild, fresh flavor and crunchy texture. Bok choy is packed with nutrients including vitamins A, C, K, calcium, potassium, folate and glucosinolates linked to cancer prevention. It works great in stir fries, braised dishes, soups and salads. Bok choy thrives in cool weather and consistently moist, fertile soil.",
      "image": "https://www.pngmart.com/files/4/Bok-Choy-PNG-Transparent-Image.png",
      "planting_tips": "Bok choy planting tips:\n\n• Direct sow seeds 1⁄2 inch deep, 2-4 weeks before last spring frost. Or start seeds indoors and transplant seedlings.\n\n• Space plants 8-12 inches apart in rows 18 inches apart. Bok choy needs good airflow.\n\n• Prepare soil by mixing in 2-3 inches of compost or manure before planting. Bok choy needs fertile soil.\n\n• Use fabric row covers over newly planted seeds/seedlings to retain moisture and prevent insect pests.\n\n• Side dress with organic fertilizer monthly. Maintain even soil moisture through irrigation if rainfall is lacking.",
      "harvesting_tips": "Bok choy harvesting tips:\n\n• Begin harvesting bok choy when the heads reach 6-8 inches tall. Cut the whole head above soil level.\n\n• Only harvest the outer, larger leaves if you want the plant to continue producing leaves.\n\n• Use a sharp knife or kitchen shears to cut leaves or whole heads off cleanly.\n\n• Harvest in the morning after dew dries for best texture and flavor.\n\n• Rinse heads and leaves gently to remove dirt. Pat dry before storing in refrigerator.",
      "suggested_weather_to_plant": "Ideal conditions for growing bok choy:\n\n• Cool weather with temperatures between 60-70°F. Can withstand light frost once mature.\n\n• Grow for spring and fall harvest. Hot temperatures over 80°F can cause bolting.\n\n• Bok choy needs full sun. Provide some shade in peak summer to prevent bolting.\n\n• Moist, fertile soil high in organic matter. Mulch helps retain moisture and reduce weeds.\n\n• Shelter from strong winds which can damage leaves and stunt growth.",
      "tools_needed_to_plant": "• Sharp kitchen knife or shears for harvesting.\n\n• Row covers to protect seedlings and keep pests away.\n\n• Garden fork for aerating and turning soil before planting.\n\n• Mulch for moisture retention and weed suppression.",
      "how_to_plant": "How to plant bok choy:\n\n• Direct sow seeds 1/2 inch deep, 2 inches apart in rows 18 inches apart 2-4 weeks before last frost.\n\n• Or start transplants indoors. Harden off and transplant into garden 6 inches apart.\n\n• Prepare soil by mixing in 2-3 inches of mature compost before planting. Side dress monthly.\n\n• Use row covers over seeded rows to boost germination rates and growth.\n\n• Maintain even soil moisture. Irrigate if rainfall is insufficient.\n\n• Harvest by cutting whole heads or outer leaves with a sharp knife when mature.",
      "fertilizer_to_use": "Good organic fertilizers for bok choy include:\n\n• Compost provides overall soil enrichment before planting.\n\n• Balanced organic granular fertilizer to side dress monthly.\n\n• Fish emulsion, compost tea, kelp extract provide nitrogen for growth."
    },
    {
      "id": "29",
      "name": "Radicchio (Radicchio)",
      "pronunciation": "rah-dee-kee-oh",
      "family": "Asteraceae",
      "genus": "Cichorium",
      "scientific_name": "Cichorium intybus",
      "description": "Radicchio is a leafy green vegetable known for its bitter, spicy taste and vibrant magenta and white leaves. It is a type of chicory closely related to Belgian endive. Radicchio contains antioxidants, vitamin K, and compounds that promote blood and liver health. The small, compact heads have crunchy leaves with white ribs. Radicchio is used in salads, grilled, baked, or sauteed. It performs best in cool weather and requires consistent watering to prevent bitterness.",
      "image": "https://purepng.com/public/uploads/large/purepng.com-radicchiovegetablesradicchio-leaf-chicory-leaf-vegetable-red-leaves-bitter-941524703543k2ev6.png",
      "planting_tips": "Radicchio planting tips:\n\n• Direct sow seeds in early spring, 1/4 inch deep and 2 inches apart in rows 18 inches apart. Or start seeds indoors.\n\n• Thin seedlings or transplant 8-12 inches apart. Radicchio needs good airflow.\n\n• Prepare soil by mixing in 2-3 inches of mature compost before planting to provide nutrients.\n\n• Use fabric row covers at seeding to enhance germination rates and protect young plants.\n\n• Consistent moisture is vital to prevent bitterness. Water near the roots, avoiding wet foliage. Add mulch to help retain moisture.",
      "harvesting_tips": "Harvesting radicchio:\n\n• Begin harvesting when heads feel firm and compact. Cut just above the root crown.\n\n• Only pick outer leaves if you want continued production. Inner leaves will continue growing.\n\n• Use a sharp knife to slice off leaves or cut whole heads cleanly near the soil.\n\n• Harvest in cool morning hours when leaves are at their crispest.\n\n• Rinse gently, pat leaves dry, and refrigerate promptly after picking to retain quality.",
      "suggested_weather_to_plant": "Ideal growing conditions for radicchio:\n\n• Cool temperatures between 60-70°F during the day and around 50°F at night.\n\n• Plant early spring for maturity in fall. Radicchio thrives as the weather cools.\n\n• Full sun exposure is preferred but can tolerate some shade. Minimum 6 hours sunlight.\n\n• Moist, fertile soil high in organic matter. Heavy clay causes stunted growth.\n\n• Shelter from strong winds. Protect from hard freezes below 25°F.",
      "tools_needed_to_plant": "• Sharp kitchen knife for harvesting leaves or whole heads.\n\n• Row covers to enhance germination and protect young seedlings.\n\n• Mulch for moisture retention and weed control.\n\n• Irrigation tools like soaker hoses or drip irrigation.",
      "how_to_plant": "How to grow radicchio:\n\n• Direct sow seeds 1/4 inch deep and 2 inches apart in rows 18 inches apart in early spring.\n\n• Or start seeds indoors, harden off and transplant 8-12 inches apart.\n\n• Side dress monthly with organic fertilizer to support growth.\n\n• Maintain even soil moisture through irrigation if rainfall is lacking.\n\n• Harvest whole heads or outer leaves by cutting with a sharp knife at soil level when mature.",
      "fertilizer_to_use": "Good organic fertilizers for radicchio:\n\n• Compost provides overall soil enrichment before planting.\n\n• Balanced organic fertilizer to side dress monthly.\n\n• Fish emulsion, compost tea give a nitrogen boost."
    },
    {
      "id": "30",
      "name": "Arugula (Arugula)",
      "pronunciation": "ah-roo-guh-lah",
      "family": "Brassicaceae",
      "genus": "Eruca",
      "scientific_name": "Eruca vesicaria",
      "description": "Arugula is a fast growing, cool season leafy green with a peppery, zesty flavor. It has long, tender jagged leaves that add a tangy punch to salads, pesto, pizza and more. Arugula is rich in antioxidants, vitamins A, C, K, folate and contains glucosinolates linked to cancer prevention. It can be grown as a cut-and-come-again crop or let bolt to flower. Arugula thrives in moderately cool conditions and quickly bolts in heat.",
      "image": "https://www.pngmart.com/files/5/Arugula-PNG-Image.png",
      "planting_tips": "Arugula planting tips:\n\n• Direct sow seeds 1/4 inch deep and 1 inch apart in rows 12 inches apart 2-4 weeks before the last frost.\n\n• Or start seeds indoors under grow lights before the last frost. Harden off and transplant seedlings 8 inches apart.\n\n• Prepare soil by mixing in 2-3 inches of compost to provide nutrients. Side dress monthly with organic fertilizer.\n\n• Keep soil consistently moist for fast growth. Water at soil level, avoid wetting leaves. Add mulch to help retain moisture.\n\n• Use row covers over seeded rows or young transplants to enhance growth and prevent insect pests.",
      "harvesting_tips": "Harvesting arugula:\n\n• Begin harvesting leaves when they are 3-4 inches tall.\n\n• Use kitchen shears to cut young leaves 1 inch above the crown to allow regrowth.\n\n• Pick leaves early in the morning when crisp and dry. Avoid afternoon heat.\n\n• Rinse leaves gently and pat dry before storing promptly in the refrigerator. Keeps 5-7 days.\n\n• Allow some plants to bolt, flower, and set seed for collecting arugula seeds.",
      "suggested_weather_to_plant": "Ideal weather conditions for arugula:\n\n• Cool temperatures between 45-60°F. Quickly bolts in heat above 75°F.\n\n• Grow for spring and fall harvest. High summer heat causes rapid bolting.\n\n• Sun to partial shade. Arugula thrives in full sun but appreciates some afternoon shade.\n\n• Moist, fertile soil high in organic matter. Heavy clay causes stunted growth and bolting.",
      "tools_needed_to_plant": "• Kitchen shears for harvesting individual leaves.\n\n• Row covers to protect seedlings from cold and pests.\n\n• Garden fork for turning compost into soil before planting.\n\n• Mulch for moisture retention and weed suppression.",
      "how_to_plant": "How to plant arugula:\n\n• Direct sow seeds 1/4 inch deep, 1 inch apart in rows 12 inches apart before last frost.\n\n• Or start transplants indoors. Harden off and transplant 8 inches apart outside.\n\n• Side dress monthly with organic fertilizer like fish emulsion or compost tea.\n\n• Maintain even soil moisture. Water at soil level to keep leaves dry.\n\n• Use shears to selectively cut young leaves 1 inch above crown for continual harvest.",
      "fertilizer_to_use": "Good organic fertilizers for arugula:\n\n• Compost provides overall soil enrichment before planting.\n\n• Balanced organic fertilizer or fish emulsion to side dress monthly.\n\n• Compost tea gives beneficial microbes and micronutrients."
    },
    {
      "id": "31",
      "name": "Endive ",
      "pronunciation": "ahn-deev",
      "family": "Asteraceae",
      "genus": "Cichorium",
      "scientific_name": "Cichorium endivia",
      "description": "Endive is a leafy vegetable with curly, frisee or broad leaves forming a loose head. It has a mildly bitter taste. Endive is rich in vitamin K, A, folate, and powerful antioxidants. Related to chicory, escarole is a type of broad leaved endive. Endive works great in salads, sandwiches, braised dishes and soups. It thrives as a fall crop started in mid to late summer and requires cool weather similar to lettuce.",
      "image": "https://www.taproduce.com/wp-content/uploads/elementor/thumbs/Endive-1-ozv7l556hc228lge97lnw3rso3yo0ekd7k7irbbi0s.png",
      "planting_tips": "Endive planting tips:\n\n• Start seeds indoors midsummer, or direct sow late summer for a fall crop. Endive grows best in cool weather.\n\n• Transplant seedlings or thin direct sown plants to 12 inches apart in rows 18 inches apart. Good airflow prevents disease.\n\n• Prepare soil by mixing in 2-3 inches of compost before planting. Side dress monthly.\n\n• Maintain even soil moisture through irrigation if rainfall is insufficient. Water at soil level.\n\n• When heads start to form, tie outer leaves together to blanch the interior for sweeter flavor.",
      "harvesting_tips": "Endive harvesting tips:\n\n• Begin harvesting endive when heads feel full and firm. Cut whole heads above the root.\n\n• Only pick outer leaves if you want continued production. Inner leaves will continue growing.\n\n• Use a sharp knife to cut leaves or whole heads cleanly near the soil line.\n\n• Harvest in the morning after dew dries when crisp and juicy.\n\n• Discard any damaged leaves which deteriorate quickly. Rinse and store promptly.",
      "suggested_weather_to_plant": "Ideal weather conditions for endive:\n\n• Cool temperatures, around 60-65°F during the day and 45-55°F at night. Protect from frost.\n\n• Grow for late summer and fall harvest. Hot weather causes rapid bolting.\n\n• Partial shade is preferred to prevent bolting, especially in warmer climates.\n\n• Consistently moist, fertile soil high in organic matter. Heavy soils cause stunted growth.",
      "tools_needed_to_plant": "• Garden ties for blanching developing heads.\n\n• Sharp kitchen knife for harvesting leaves or whole heads.\n\n• Row covers to protect seedlings and keep growing plants cool.",
      "how_to_plant": "How to grow endive:\n\n• Direct sow in late summer for fall crop or start seeds indoors midsummer.\n\n• Transplant or thin seedlings to 12 inches apart, 18 inches between rows.\n\n• Side dress monthly with organic fertilizer like fish emulsion.\n\n• Blanch interior by tying outer leaves together when heads size up.\n\n• Maintain even moisture. Water at soil level to keep foliage dry.\n\n• Harvest whole heads or outer leaves using a sharp knife.",
      "fertilizer_to_use": "Good organic fertilizers for endive:\n\n• Compost provides overall soil enrichment before planting.\n\n• Balanced organic fertilizer or fish emulsion to side dress monthly.\n\n• Compost tea supplies beneficial microbes and micronutrients."
    },
    {
      "id": "32",
      "name": "Watercress (Kangkong)",
      "pronunciation": "waw-ter-kres",
      "family": "Brassicaceae",
      "genus": "Nasturtium",
      "scientific_name": "Nasturtium officinale",
      "description": "Watercress is a leafy green vegetable grown for its tangy, peppery flavored leaves and stems. It forms lush green mats of rounded leaves and thrives when grown hydroponically in gently flowing fresh water. Watercress is packed with antioxidants, vitamins A, C, K, calcium, and folate. It has been revered since ancient times for its medicinal properties. Watercress works well in salads, sandwiches, soups and sauces. It is one of the oldest known leaf vegetables still popular today.",
      "image": "https://cdn.store-assets.com/s/1113698/i/54550523.png?width=1024&format=webp",
      "planting_tips": "Watercress planting tips:\n\n• Purchase live starter plugs or cuttings. Watercress grows best from vegetative cuttings, not seeds.\n\n• Plant in a shallow tray, tin or pool with a gentle flow of fresh, clean water 1-3 inches deep.\n\n• Prepare a rich soil mix amended with compost for the cuttings to root into.\n\n• Space plants 4 inches apart. Keep water oxygenated by gently trickling into the container.\n\n• Harvest frequently, cutting stems 2 inches above the root. Allow regrowth between cuttings.",
      "harvesting_tips": "Harvesting watercress:\n\n• Begin harvesting watercress about 6-8 weeks after planting plugs.\n\n• Use kitchen shears to clip leafy stems 2 inches above the root in the water.\n\n• Harvest frequently, taking no more than one third of growth at a time.\n\n• Pick in the morning for optimal flavor and texture.\n\n• Rinse gently in cool water. Eat watercress immediately after harvesting for best quality.",
      "suggested_weather_to_plant": "Ideal conditions for growing watercress:\n\n• Thrives in cool weather between 55-70°F.\n\n• Able to grow year round in most climates when provided flowing water.\n\n• Partial shade is preferred to prevent bolting in warmer weather.\n\n• Clean, flowing fresh water 1-3 inches deep is vital. Change water often to prevent fouling.\n\n• Protect from harsh winter freezes by growing indoors or in a greenhouse.",
      "tools_needed_to_plant": "• Container like a plastic bin, tray or small child's pool.\n\n• Aquarium pump to gently bubble water.\n\n• Sharp kitchen shears for harvesting leafy stems.\n\n• Netting or drainage holes to contain but allow water flow.",
      "how_to_plant": "How to plant watercress:\n\n• Obtain live starter plugs or cuttings. Watercress is typically grown from cuttings.\n\n• Plant in a shallow container filled with clean, flowing fresh water 1-3 inches deep.\n\n• Enrich container with soil mix amended with compost for cuttings to root into.\n\n• Keep water gently flowing and oxygenated using a small pump.\n\n• Frequently harvest leafy stems about 2 inches above the root using kitchen shears.",
      "fertilizer_to_use": "Good fertilizers for hydroponically grown watercress:\n\n• Use a hydroponic nutrient solution formulated for leafy greens.\n\n• Mix in a balanced organic hydroponic fertilizer to the water per product instructions.\n\n• Introduce beneficial microbes like mycorrhizae into the water to support roots and nutrient uptake."
    },
    {
      "id": "33",
      "name": "Mung Bean (Monggo)",
      "pronunciation": "muhng been",
      "family": "Fabaceae",
      "genus": "Vigna",
      "scientific_name": "Vigna radiata",
      "description": "Mung beans are a warm season legume grown for their edible seeds and sprouts. They have green oval shaped pods containing small green seeds that are cooked as a savory dish or sprouted and eaten raw. Mung beans are high in protein, fiber, antioxidants, folate, potassium, iron and vitamin C. They fix nitrogen in the soil, making them valuable in crop rotations. Mung beans thrive in hot, dry conditions unsuitable for many other crops. They are drought tolerant and grow on semi-prostrate bushy plants.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Mung_beans.png",
      "planting_tips": "Tips for planting mung beans:\n\n- Direct sow seeds when soil reaches 65°F, after danger of frost. Space 2-3 inches apart, rows 18-24 inches apart.\n\n- Mung beans thrive in full sun and hot, dry conditions with temperatures above 80°F.\n\n- They require well-drained soils and are extremely drought tolerant requiring little irrigation.\n\n- Inoculate seeds with a nitrogen-fixing bacteria before planting to help plants fix nitrogen.",
      "harvesting_tips": "Mung bean harvesting tips:\n\n- Monitor moisture content of pods to determine harvest time. Overly dry pods shatter and spill seeds.\n\n- When most pods turn brown but are still pliable, cut plants near soil level and hang upside down in a dry location. \n\n- Once fully dried, rub pods between hands over a container to separate beans.\n\n- Pick pods daily as they ripen to prevent losses. Avoid picking wet pods which mold in storage.\n\n- Remove any dirt, damaged beans or plant debris. Store dried mung beans in airtight containers.",
      "suggested_weather_to_plant": "Ideal weather conditions for mung beans:\n\n- Hot temperatures above 80°F. Mung beans thrive in heat.\n\n- Full sun exposure. Mung beans require at least 8 hours of direct sunlight daily.\n\n- Well-drained soil. Heavy soils cause root rot. Sandy loam or loam soils are ideal.\n\n- Low humidity with dry arid conditions. Mung beans are extremely drought tolerant.",
      "tools_needed_to_plant": "• Inoculant for coating seeds to enhance nitrogen fixation.\n\n- Trellis, poles or fencing for semi-prostrate bush varieties to climb. \n\n- Bypass pruners for harvesting pods.\n\n- Burlap bags for drying bean pods after harvest.",
      "how_to_plant": "How to plant mung beans:\n\n- Prepare soil and direct sow seeds 2-3 inches apart in rows 18-24 inches apart when soil reaches 65°F.\n\n- Before planting, coat seeds with inoculant containing nitrogen-fixing bacteria.\n\n- Provide poles, trellises or fencing for semi-prostrate bush types to climb on.\n\n- Allow pods to dry on plants before harvesting. Cut plants and hang upside down to finish drying indoors.\n\n- Remove beans from dry pods by rubbing together over a container before storage.",
      "fertilizer_to_use": "Good fertilizers for mung beans:\n\n- Inoculant on seeds before planting to promote nitrogen fixation. \n\n- Compost provides overall soil improvement before planting."
    },

    {
      "id": "34",
      "name": "Soursop (Guyabano)",
      "pronunciation": "sowr-sahp",
      "family": "Annonaceae",
      "genus": "Annona",
      "scientific_name": "Annona muricata",
      "description": "Soursop is a tropical fruit tree native to the Philippines grown for its large, spiny green fruit. The inside pulp is creamy white with a tangy, tropical flavor. Soursop contains significant amounts of vitamin C, B vitamins, antioxidants, and other beneficial plant compounds. The fruit is eaten fresh, made into smoothies, ice cream, candies or sorbets. Soursop trees prefer warm, humid tropical climates but take several years to begin fruiting.",
      "image": "https://assets.stickpng.com/images/5a5f6180ee40df432bfac53e.png",
      "planting_tips": "Tips for planting soursop:\n\n- Start trees from cuttings or air-layering. Trees grown from seeds take much longer to fruit.  \n\n- Plant in fertile, well-draining soil, enriched with compost. Proper drainage is vital.\n\n- Space trees at least 15-20 feet apart for adequate air circulation and sun exposure.\n\n- Provide support staking or trellising for the first 1-2 years until tree establishes.\n\n- Irrigate young trees regularly until established. Mature soursop can withstand short dry periods.",
      "harvesting_tips": "Harvesting soursop fruits:\n\n- Pick soursops when fully sized but still firm before they begin to soften. Harvest with clippers, leaving the stem attached.\n\n- Twist fruit gently to separate from tree. Be careful not to damage branches which can introduce disease. \n\n- Place picked fruits in soft bedding to avoid bruising the thin skin during transport. \n\n- Store harvested soursops in a cool room for 2-3 days maximum to ripen further before consumption.\n\n- Once ripened, peel off the bumpy green skin and remove black seeds. The creamy pulp can then be eaten or processed.",
      "suggested_weather_to_plant": "Ideal conditions for growing soursop:\n\n- Tropical or subtropical climates with temperatures from 70-95°F year-round. Protect trees from frost.\n\n- High humidity is preferred. Rainfall of at least 50-100 inches per year is ideal.\n\n- Full sun exposure. Soursop trees need maximum sunlight for best growth and fruiting.\n\n- Well-draining, fertile soil high in organic matter. Heavy clay results in chlorosis.",
      "tools_needed_to_plant": "• Bypass pruners for harvesting fruits without damaging branches.\n\n- Loppers for removing suckers and pruning branches.  \n\n- Stakes and tree ties for staking young trees.\n\n- Spading fork for preparing soil beds.",
      "how_to_plant": "How to plant soursop trees:\n\n- Prepare growing area in advance by double digging beds and amending soil with compost.\n\n- Obtain air-layered or cutting propagated trees. Plant 15-20 feet apart for adequate sun and air circulation.  \n\n- Stake young trees for support for the first 1-2 years until established.\n\n- Irrigate and fertilize trees regularly to promote vigorous growth and fruiting.\n\n- Harvest fruits by clipping stems with bypass pruners when full sized but still firm.",
      "fertilizer_to_use": "Good organic fertilizers for soursop trees:\n\n- Compost, aged manure, worm castings provide overall soil enrichment.\n\n- Balanced organic fruit tree fertilizer to feed annually in early spring.  \n\n- Compost tea every 4-6 weeks gives beneficial microbes and micronutrients."
    },

    {
      "id": "35",
      "name": "Eggfruit (Puit)",
      "pronunciation": "egg-froot",
      "family": "Sapindaceae",
      "genus": "Pouteria",
      "scientific_name": "Pouteria campechiana",
      "description": "Eggfruit, also called canistel, is a tropical fruit native to southern Mexico and Central America now grown throughout Southeast Asia. Eggfruit gets its name from the shiny egg shaped orange or yellow fruits about the size of chicken eggs. The creamy textured flesh is sweet and nutty tasting. Eggfruits are rich in antioxidants, B vitamins, vitamin C, potassium and magnesium. Trees thrive in humid, frost-free climates and begin fruiting 2-3 years after planting.",
      "image": "https://o.remove.bg/downloads/86c761c9-d2ce-409d-8897-653c2566c29f/pngtree-egg-yolk-nutritious-gourmet-fruit-png-image_3628319-removebg-preview.png",
      "planting_tips": "Tips for growing eggfruit:\n\n- Start trees from cuttings, grafting or air-layering. Grafted trees begin bearing fruits within 2 years.\n\n- Plant in a warm, tropical climate free from frost. Trees need full sun and good airflow. \n\n- Prepare soil by double digging beds and mixing in compost for nutrition and drainage.\n\n- Irrigate young trees until established. Mature eggfruit trees are fairly drought tolerant.\n\n- Prune to shape trees and improve air circulation and light penetration which maximizes fruiting.",
      "harvesting_tips": "Harvesting eggfruit: \n\n- Harvest fruits when skin turns from green to glossy orange/yellow and yields slightly when squeezed gently.\n\n- Clip stems with hand pruners rather than pulling fruits to avoid branch damage. \n\n- Harvest promptly before fruits become overripe. Shelf life is only 2-3 days at room temperature.\n\n- Handle fruits carefully to avoid bruising. Transport in soft bedding like newspaper or hay.\n\n- Store ripe eggfruits in the refrigerator for up to 1 week. Enjoy raw or use for baked goods, shakes, ice cream.",
      "suggested_weather_to_plant": "Ideal conditions for eggfruit trees:\n\n- Tropical or subtropical climate with temperatures from 70-90°F year-round. Protect from frost.\n\n- High humidity, at least 60%. Consistent moisture through rainfall or irrigation.\n\n- Full sun exposure to maximize fruit production. Minimum 8-10 hours direct sunlight.\n\n- Well-draining fertile soil high in organic matter. Avoid soggy, clay soils.",
      "tools_needed_to_plant": "• Bypass pruners for harvesting fruit without damaging branches.\n\n- Hand clippers for pruning and shaping trees.\n\n- Compost and organic fertilizer to prepare planting area.\n\n- Spading fork for turning in soil amendments.",
      "how_to_plant": "How to plant eggfruit trees: \n\n- Select a warm site with full sun and well-draining fertile soil. Double dig beds and mix in compost.  \n\n- Obtain grafted or cutting propagated trees. Space 15-20 feet apart.\n\n- Stake young trees until established then prune annually to shape.\n\n- Fertilize in early spring and irrigate regularly until fruiting begins.\n\n- Harvest ripe fruits promptly using hand pruners to detach from stems.",
      "fertilizer_to_use": "Good organic fertilizers for eggfruit trees:\n\n- Compost, worm castings, aged manure provide overall soil nutrition.\n\n- Balanced fruit tree fertilizer to feed annually in early spring.\n\n- Fish emulsion or compost tea every 4-6 weeks during fruiting season."
    },

    {
      "id": "36",
      "name": "Pili Nut",
      "pronunciation": "pee-lee nuht",
      "family": "Sapindaceae",
      "genus": "Canarium",
      "scientific_name": "Canarium ovatum",
      "description": "Pili nuts are the edible seeds inside the fruit of native Philippines tropical trees. The oval shaped nuts have a delicate, creamy texture and mild, nutty flavor when roasted. Pili nuts contain heart-healthy fats, protein, vitamins, minerals and antioxidants. Oil is also extracted from the nuts. Pili trees thrive in humid, tropical environments with sandy soil and bear clusters of fruit containing the nuts.",
      "image": "https://o.remove.bg/downloads/27c76601-6a3b-4b81-8114-9d6e915a9ab1/3e2a16213dd7663d-ZHoB91y6-zoom-removebg-preview.png",
      "planting_tips": "Tips for planting pili nut trees:\n\n- Start trees from fresh seeds planted directly into permanent location. Soak seeds 48 hours before planting.  \n\n- Space trees 40-50 feet apart in full sun for good air circulation. Pili trees develop wide spreading canopies.\n\n- Prepare planting area by digging beds, loosening soil, and mixing in compost for drainage and nutrition.\n\n- Irrigate young trees regularly until established. Mature trees are fairly drought tolerant. \n\n- Prune trees annually to remove dead branches which can harbor pests and disease.",
      "harvesting_tips": "Harvesting pili nuts:\n\n- Monitor fruits to gauge ripeness. Harvest when outer shells begin cracking exposing the nuts inside.\n\n- Pick clusters by clipping fruit stems rather than pulling to avoid damaging branches.\n\n- Spread harvested fruits in a single layer and allow to further ripen for a few days before removing nuts.\n\n- Extract nuts by hand, discarding outer shells. Rinse nuts thoroughly before drying.\n\n- Dry freshly harvested nuts fully before roasting or storage to maintain quality.",
      "suggested_weather_to_plant": "Ideal conditions for growing pili nut trees:\n\n- Humid tropical environment with temperatures from 70-100°F year round. Protect from frost.\n\n- Heavy rainfall exceeding 120 inches per year is preferred. Supplemental irrigation may be needed in dry periods.\n\n- Full sun exposure to maximize fruit and nut production. \n\n- Well-draining, sandy loam soil. Avoid heavy clay which causes root rot.",
      "tools_needed_to_plant": "• Bypass pruners for harvesting fruit clusters without damaging branches. \n\n- Loppers for pruning large branches and shaping trees.\n\n- Rake and shovel for preparing soil beds. \n\n- Burlap bags for drying harvested nuts.",
      "how_to_plant": "How to plant pili nut trees:\n\n- Select an open, sunny site with well-drained fertile soil. Prepare beds by loosening soil and mixing in compost.\n\n- Sow pre-soaked seeds directly where trees are to grow, spaced 40-50 feet apart each way.\n\n- Water young trees regularly until established. Apply organic fertilizer annually.\n\n- Prune trees after fruiting to remove dead branches and shape canopies.\n\n- Harvest fruit clusters when shells begin cracking using bypass pruners. Extract nuts, then dry fully.",
      "fertilizer_to_use": "Good organic fertilizers for pili nut trees:\n\n- Compost, aged manure provides overall soil enrichment before planting.  \n\n- Balanced organic tree fertilizer to feed annually in early spring.\n\n- Fish emulsion every 4-6 weeks during fruit development."
    },
    {
      "id": "37",
      "name": "Rambutan",
      "pronunciation": "ram-boo-tan",
      "family": "Sapindaceae",
      "genus": "Nephelium",
      "scientific_name": "Nephelium lappaceum",
      "description": "Rambutan is a tropical fruit native to Southeast Asia and closely related to the lychee. The oval shaped fruits have a thin, leather-like pinkish red skin covered in soft spines. Inside is a translucent white flesh with a sweet, juicy flavor encasing a large seed. Rambutan is rich in vitamin C, antioxidants and beneficial plant compounds. The fruit is eaten fresh or used in jams, juices or desserts. Rambutan trees can begin fruiting in 3-5 years. They prefer warm, humid tropical climates with wet conditions.",
      "image": "https://www.jctropicals.us/wp-content/uploads/2021/03/jc-tropical-rambutan-fruit.png",
      "planting_tips": "Tips for growing rambutan:\n\n- Start trees from fresh seeds, grafted cuttings or air-layers for faster fruiting. Germinating seeds can take many weeks.\n\n- Plant in fertile, well-draining soil high in organic matter. Proper drainage is vital to prevent fungal root rot. \n\n- Space trees at least 20 feet apart for adequate air circulation and sun exposure. Rambutan needs full sun.\n\n- Irrigate young trees regularly until established. Mature trees are fairly drought tolerant but produce better with ample moisture.\n\n- Prune annually to remove dead branches, improve air circulation and shape trees.",
      "harvesting_tips": "Harvesting rambutan fruits:\n\n- Monitor fruits for peak ripeness when skins turn bright red and spines begin to wither. Picked fruits only store 1-2 days.\n\n- Use clippers to cut fruit clusters from branches, leaving some stem attached. Avoid pulling fruits off.\n\n- Transport picked fruits laying in a single layer to avoid bruising and damage.\n\n- To consume, make a small tear in the leathery skin and peel it off to expose the sweet translucent flesh around the seed.\n\n- Refrigerate ripe fruits right away and consume within 2 days. The spikes on skin cling to each other so store carefully.",
      "suggested_weather_to_plant": "Ideal conditions for growing rambutan:\n\n- Hot, humid tropical or subtropical climate. Temperatures from 75-95°F. Avoid frost.\n\n- Heavy rainfall around 70-150 inches per year. Supplement irrigation during dry periods.  \n\n- Full sun exposure to maximize fruit production. At least 8 hours direct sun daily.\n\n- Well-draining, fertile soil high in organic matter. Heavy clay causes root rot issues.",
      "tools_needed_to_plant": "- Bypass pruners for harvesting fruit clusters without damaging branches.\n\n- Loppers for pruning and shaping trees as they mature.\n\n- Compost, organic fertilizer to prepare planting area.\n\n- Spading fork for double digging beds.",
      "how_to_plant": "How to plant rambutan trees:\n\n- Select a site with full sun, good drainage and shelter from strong winds. Double dig beds and amend soil with compost\n\n- Obtain grafted or air-layered trees for faster fruiting. Or plant seeds directly. Space at least 20 feet apart\n\n- Stake young trees and prune annually to shape. Irrigate regularly\n\n- Provide ample moisture and fertilize each spring to support fruit production\n\n- Harvest ripe fruits by clipping clusters from branches using clean bypass pruners.",
      "fertilizer_to_use": "Good organic fertilizers for rambutan trees:\n\n- Compost, worm castings provides overall soil enrichment.\n\n- Balanced organic fruit tree fertilizer annually in early spring.\n\n- Fish emulsion monthly during fruit development."
    },

    {
      "id": "38",
      "name": "Chico Fruit",
      "pronunciation": "chee-koh froot",
      "family": "Sapotaceae",
      "genus": "Manilkara",
      "scientific_name": "Manilkara zapota",
      "description": "Chico fruit, also known as sapodilla, is a slow growing evergreen tropical fruit tree native to southern Mexico and Central America. The oval shaped fruits have brown leathery skin and sweet, malty brown flesh containing smooth black seeds. Chico is high in antioxidants, vitamin C, fiber and beneficial plant compounds. It is eaten fresh, used in ice cream, milkshakes or fruit bars. Trees may take up to 8 years from seedling to bear fruit but just 2-3 years if grafted. Chico thrives in humid, frost-free climates.",
      "image": "https://o.remove.bg/downloads/db704361-f1a5-4fc8-9760-e2cf013997bd/sapodilla-fruits-th-foto-werbungscience-photo-library-removebg-preview.png",
      "planting_tips": "Tips for planting chico trees\n\n- Start trees from fresh seeds, grafted cuttings or air-layers for faster fruiting. Germination is slow and erratic from seed\n\n- Space trees at least 20 feet apart with access to full sun for best fruit production and air circulation\n\n- Prepare growing area by digging beds, loosening soil, and mixing in aged compost or manure for drainage\n\n- Irrigate and fertilize young trees regularly until established. Mature trees still need ample water during fruiting\n\n- Prune annually to shape trees, improve air flow and light penetration which maximizes fruiting.",
      "harvesting_tips": "Harvesting chico fruit\n\n- Harvest fruits when full grown and skin becomes brownish and slightly glossy. Fruit detach easily when ripe\n\n- Pick by clipping stems to avoid damaging branches. Do not pull fruits off the trees\n\n- Transport carefully laying single layer to prevent bruising. Handle gently, fruits bruise easily\n\n- Ripe fruits yield slightly when squeezed. Store at room temp until fully softened, 2-3 days max.\n\n- Once ripe, peel skin and remove seeds. Flesh is edible fresh or processed into desserts.",
      "suggested_weather_to_plant": "Ideal conditions for chico fruit trees\n\n- Tropical or subtropical climate, no lower than 50°F. Protect young trees from frost\n\n- Consistent warm temperatures and high humidity preferred\n\n- Full sun exposure needed for best fruit production. Minimum 8 hours direct sun daily\n\n- Well-draining, fertile soil high in organic matter. Heavy clay causes issues.",
      "tools_needed_to_plant": "- Bypass hand pruners for harvesting fruits without damaging branches\n\n- Spading fork, compost and fertilizer for preparing planting area\n\n- Loppers for pruning branches as trees mature\n\n- Tree stakes for staking young saplings.",
      "how_to_plant": "How to plant chico fruit trees\n\n- Select a site with full sun, good drainage and shelter. Double dig beds and mix in compost\n\n- For faster fruiting, obtain grafted trees or air-layers. Or start seeds. Space 20 feet apart\n\n- Stake young trees. Prune annually to shape. Irrigate and fertilize regularly until established\n\n- Provide ample water and fertilizer during fruiting season for highest yields\n\n- Harvest fully ripe fruits by snapping stems off trees using clean hand pruners.",
      "fertilizer_to_use": "Good organic fertilizers for chico trees\n\n- Compost, worm castings, manure for overall soil enrichment\n\n- Balanced organic fruit tree feed in early spring annually\n\n- Fish emulsion monthly during fruit development."
    },

    {
      "id": "39",
      "name": "Avocado",
      "pronunciation": "av-uh-kah-doh",
      "family": "Lauraceae",
      "genus": "Persea",
      "scientific_name": "Persea americana",
      "description": "Avocado is a nutrient dense fruit with green bumpy skin and creamy, rich fatty flesh. It is loaded with healthy fats, fiber, antioxidants, vitamins C, E, K and folate. The subtly flavored fruit is used in salads, dips, sandwiches and smoothies. Avocado trees grow in warm climates and produce fruits year round once mature. There are many cultivars ranging widely in cold hardiness, tree size and fruit characteristics.",
      "image": "https://o.remove.bg/downloads/e0a2e4f2-785d-4f6e-9bf1-eb1888439d03/png-clipart-avocado-avocado-removebg-preview.png",
      "planting_tips": "Tips for planting avocado trees\n\n- Start grafted trees for earlier fruiting, 3-4 years from planting versus 8-10 years from seed\n\n- Choose disease resistant cultivars adapted to your climate. Consult local nurseries for best variety selections\n\n- Plant in fertile, well-draining soil in full sun. Space trees at least 25 feet apart for air circulation\n\n- Irrigate regularly to establish newly planted and young trees. Mature trees are fairly drought tolerant\n\n- Provide wind protection for young trees. Prune annually to shape maturing trees and improve sunlight penetration.",
      "harvesting_tips": "Harvesting avocados\n\n- Harvest when fruit stems detach easily with a gentle lift. Use clippers to cut fruits from branches\n\n- Store fruits at room temperature until ripe. Speed ripening by placing in a paper bag for a few days\n\n- Ripe fruits yield slightly when squeezed gently. Use within 1-2 days of ripening\n\n- Cut open lengthwise around pit. The flesh should not be mushy or brown. Discard if so\n\n- Prevent oxidation by leaving pit in one half, sprinkling with lemon or lime juice or coating cut surfaces with plastic wrap.",
      "suggested_weather_to_plant": "Ideal conditions for growing avocados\n\n- Warm, mostly frost-free climate. Temperatures ideally between 60-85°F year-round\n\n- Low humidity preferred. Avocados are prone to fungal diseases in very humid conditions\n\n- Full sun exposure. Avocado trees produce best with 8 hours of direct sunlight daily minimum.\n\n- Well-draining, fertile soil. Avoid soggy, poorly drained locations.",
      "tools_needed_to_plant": "- Bypass hand pruners for harvesting fruits without damaging branches.\n\n- Loppers for pruning trees.\n\n- Compost, organic fertilizer to prepare planting site.\n\n- Shovel for planting tree and digging irrigation basins.",
      "how_to_plant": "How to plant avocado trees\n\n- Choose a sunny, sheltered site with well-draining fertile soil. Dig in compost before planting\n\n- Plant grafted trees or established seedlings, spacing at least 25 feet apart each way\n\n- Stake young trees and irrigate regularly until established\n\n- Prune annually to shape trees, improve air circulation and sunlight exposure\n\n- Harvest fruits by clipping stems with secateurs when they detach easily from branches.",
      "fertilizer_to_use": "Good organic fertilizers for avocado trees\n\n- Compost, aged manure, worm castings for soil enrichment\n\n- Balanced organic tree fertilizer to feed each spring\n\n- Fish emulsion monthly during fruit development."
    },
    {
      "id": "40",
      "name": "Mango", 
      "pronunciation": "mang-goh",
      "family": "Anacardiaceae",
      "genus": "Mangifera", 
      "scientific_name": "Mangifera indica",
      "description": "Mango is a juicy stone fruit native to South Asia now cultivated in tropical regions worldwide. Hundreds of cultivars exist, varying in shape, size, color, flavor, and texture. The fruits are eaten fresh, used in juices, smoothies, desserts, and chutneys. Mangoes contain antioxidants, vitamin C, vitamin A precursors, potassium, and dietary fiber. Grafted mango trees can begin fruiting 3-4 years after planting and continue producing for 40 years or more. They require warm, frost-free climates with hot summers and low humidity.",
      "image": "https://o.remove.bg/downloads/2cae790f-8214-44d3-9322-4e53fce79fc1/20-201567_mango-png-free-download-mango-fruits-removebg-preview.png", 
      "planting_tips": "Tips for planting mango trees:\n\n- Start with grafted cultivars adapted for your climate instead of growing from seed. Grafted trees fruit in 3-4 years versus 8-10 years from seed.\n\n- Prepare soil by digging beds, loosening soil, and mixing in aged compost or manure to a depth of 2 feet.\n\n- Plant grafted saplings or air layers spaced at least 20 feet apart for adequate sunlight and air circulation.\n\n- Irrigate regularly to establish young trees their first few years. Mature mangoes can withstand short dry periods.\n\n- Prune annually to remove dead branches, shape trees, improve air flow, and maximize fruiting.",
      "harvesting_tips": "Harvesting mangoes:\n\n- Look for full sized fruits that change color and detach easily when lifted. Use clippers to cut fruits from branches without damaging trees.\n\n- Allow harvested mangoes to ripen fully at room temperature for best flavor. Ripening can take 5-15 days depending on the cultivar.\n\n- Ripe mangoes yield slightly when squeezed gently. The flesh inside should give but not be mushy. Discard any bruised or spoiled fruits.\n\n- Store ripe mangoes in the refrigerator for up to 5 days. Enjoy raw, sliced, or processed into juices, smoothies, desserts, and chutneys.",
      "suggested_weather_to_plant": "Ideal conditions for growing mangoes:\n\n- Tropical or subtropical climate free from frost. Temperatures between 65-100°F year-round.\n\n- Low humidity is preferred. High humidity increases disease issues.\n\n- Full sun exposure. Mango trees need at least 8 hours of direct sunlight daily for best fruit production.\n\n- Well-draining, fertile soil high in organic matter. Avoid heavy clay soils.",
      "tools_needed_to_plant": "- Bypass hand pruners for harvesting fruit without damaging branches.\n\n- Loppers for pruning trees as they mature.\n\n- Compost, organic fertilizer to prepare planting site.\n\n- Spading fork for digging beds and loosening soil.",
      "how_to_plant": "How to plant mango trees:\n\n- Select a sunny, sheltered site with well-draining fertile soil. Prepare beds by loosening soil and mixing in aged compost/manure.\n\n- Obtain grafted cultivars suitable for your climate. Plant grafted saplings or air layers spaced 20+ feet apart.\n\n- Stake young trees and irrigate regularly to establish. Prune annually to shape trees.\n\n- Allow 3-4 years from planting for grafted trees to begin fruiting. Harvest ripe fruits promptly using clean pruners.",
      "fertilizer_to_use": "Good organic fertilizers for mango trees:\n\n- Compost, aged manure, worm castings provide overall soil enrichment.\n\n- Balanced organic tree fertilizer annually each spring.\n\n- Fish emulsion or compost tea monthly during fruit development."
    },

    {
      "id": "41",
      "name": "Lanzones",
      "pronunciation": "lan-zohns",
      "family": "Meliaceae",
      "genus": "Lansium",
      "scientific_name": "Lansium parasiticum", 
      "description": "Lanzones is a tropical fruit tree native to Southeast Asia cultivated for its clusters of round, sweet edible fruits. The leathery peeled fruits contain 1-3 seeds and taste like a combination of grapes and lychee. Lanzones are high in antioxidants, vitamin C, B vitamins, phosphorus, and potassium. Trees grow rapidly when young but take 5-8 years to bear fruit. They thrive in humid, tropical climates with evenly distributed rainfall throughout the year.",  
      "image": "https://o.remove.bg/downloads/7597f7ad-1967-4de2-8837-81913544c48c/1000_F_223093171_t2jDc9XiMGPL7N0PcEsP1nIj4QO7GI5z-removebg-preview.png",
      "planting_tips": "Tips for planting lanzones trees:\n\n- Start with air layers or grafted saplings. Trees grown from seed take much longer to fruit.\n\n- Prepare soil by double digging beds, loosening soil, and mixing in compost or aged manure.\n\n- Plant grafted trees or air layers spaced at least 25 feet apart for adequate sunlight and air flow.\n\n- Stake and train young trees to encourage proper growth habit. Prune annually to shape maturing trees.\n\n- Irrigate regularly until trees are established. Mature trees still require ample water during fruit development.",
      "harvesting_tips": "Harvesting lanzones:\n\n- Monitor fruits for signs of ripening like color change and detachment when lifted. Picked fruits only store 2-4 days.\n\n- Use hand pruners to clip fruit clusters from branches without pulling or twisting.\n\n- Transport picked fruits carefully in a single layer to prevent bruising.\n\n- Peel off the thin leathery skin before eating raw or processing. Discard any spoiled fruits.\n\n- Refrigerate ripe fruit immediately after harvest and consume within 2-4 days.",
      "suggested_weather_to_plant": "Ideal conditions for lanzones trees:\n\n- Tropical or subtropical climate free from frost. Temperatures around 75-90°F year-round.\n\n- Heavy seasonal rainfall. Lanzones require at least 40 inches of rain distributed throughout the year.\n\n- Full sun exposure for best fruit production. At least 8 hours of direct sunlight daily minimum.\n\n- Well-draining, fertile soil high in organic matter. Heavy clay causes root issues.",
      "tools_needed_to_plant": "- Bypass hand pruners for harvesting fruit without damaging branches.\n\n- Shovel for preparing soil beds.\n\n- Compost, organic fertilizer to prepare planting site.\n\n- Tree stakes for staking and training young trees.",
      "how_to_plant": "How to plant lanzones trees:\n\n- Select a site with full sun, fertile soil, and shelter from strong winds. Dig beds and mix in aged compost/manure.\n\n- Obtain air layers or grafted saplings. Space trees 25 feet apart. \n\n- Stake and train young trees to encourage proper growth. Prune annually.\n\n- Irrigate and fertilize regularly until trees are established and fruiting. \n\n- Harvest ripe fruit clusters promptly using clean hand pruners.",
      "fertilizer_to_use": "Good organic fertilizers for lanzones trees:\n\n- Compost, aged manure provides overall soil enrichment.\n\n- Balanced organic tree fertilizer annually each spring.  \n\n- Fish emulsion monthly during fruit development."
    },

    {
      "id": "42",
      "name": "Jackfruit",
      "pronunciation": "jak-froot", 
      "family": "Moraceae",
      "genus": "Artocarpus",
      "scientific_name": "Artocarpus heterophyllus",
      "description": "Jackfruit is an enormous tropical fruit capable of reaching over 80 pounds in size. Inside the green, thorny outer skin is bulbous yellow flesh with a sweet, fruity aroma. Unripe jackfruit is used in savory dishes. When ripe, the sweet musky pulp is eaten raw, made into desserts, or processed into chips or flour. Jackfruit contains vitamin C, potassium, calcium, iron and antioxidants. Trees are fast growing but take 3-8 years to bear fruit. Jackfruit thrives in humid tropical climates.",  
      "image": "https://www.pngmart.com/files/16/Juicy-Jackfruit-Transparent-PNG.png",
      "planting_tips": "Tips for planting jackfruit trees:\n\n- Start with grafted or air layer saplings for faster fruiting. Trees from seed take much longer.\n\n- Prepare soil by double digging beds, loosening soil, mixing in aged compost or manure.\n\n- Plant grafted saplings or air layers spaced at least 30 feet apart for adequate space, sun and air circulation.\n\n- Prune annually to shape trees, improve air flow and light penetration which maximizes fruiting.\n\n- Irrigate young trees regularly until established. Mature trees still need ample moisture while fruiting.",
      "harvesting_tips": "Harvesting jackfruit:\n\n- Monitor fruits for signs of ripening like color change, softening, and distinctive aroma. Use clippers to cut ripe fruits from tree.\n\n- Allow harvested fruits to finish ripening for 2-3 days at room temp before cutting open.\n\n- Ripe jackfruit has melting, sweet, aromatic pulp. Unripe fruits are firm with neutral flavor used in cooked dishes.\n\n- Once open, separate bulbs of flesh from skin and seeds. Refrigerate ripe pulp immediately to store up to 2 weeks.",
      "suggested_weather_to_plant": "Ideal conditions for jackfruit trees:\n\n- Hot, humid tropical climate free of frost and temperatures from 70-95°F year-round.\n\n- Heavy annual rainfall of at least 50 inches evenly distributed.\n\n- Full sun exposure to maximize fruit production. Jackfruit needs at least 8 hours direct sun daily minimum.\n\n- Well-draining, fertile soil high in organic matter. Avoid clay soils prone to waterlogging.",
      "tools_needed_to_plant": "- Bypass hand pruners for harvesting fruits without damaging branches.\n\n- Loppers for pruning branches.\n\n- Shovel for preparing deep soil beds. \n\n- Compost, organic fertilizer to prepare planting site.",
      "how_to_plant": "How to plant jackfruit trees:\n\n- Select site with full sun, shelter, and fertile soil. Dig beds 2 feet deep, mix in aged compost/manure.\n\n- Obtain grafted saplings or air layers for faster fruiting. Space 30 feet apart.\n\n- Stake young trees. Prune annually to shape. Irrigate and fertilize regularly until established.\n\n- Allow 3-8 years from planting for trees to begin fruiting. Harvest ripe fruits promptly with pruners.",
      "fertilizer_to_use": "Good organic fertilizers for jackfruit trees:\n  \n- Compost, aged manure provides overall soil enrichment.\n\n- Balanced organic tree fertilizer annually each spring.\n\n- Fish emulsion monthly during fruit development."
    },
    {
      "id": "43",
      "name": "Durian",
      "pronunciation": "dure-ee-an",
      "family": "Malvaceae",
      "genus": "Durio",
      "scientific_name": "Durio zibethinus",
      "description": "Durian is a large tropical fruit renowned for its unique taste and infamous odor. Under the hard, spiky outer shell are segments of soft custard-like flesh with a sweet almond flavor. Durian is high in nutrients like vitamin C, potassium, fiber, B vitamins, copper, manganese, and tryptophan. However the strong smell limits its popularity outside Southeast Asia where it originates. Durian trees are large, growing over 100 feet tall and living up to 300 years. They take 4-5 years to fruit.",  
      "image": "https://assets.stickpng.com/images/5a5f6131ee40df432bfac536.png",
      "planting_tips": "Tips for planting durian trees:\n\n- Start with grafted saplings instead of seed. Grafted trees begin fruiting in 4-5 years versus 8-15 years from seed.\n\n- Prepare deep soil beds, loosening soil and mixing in aged compost or manure thoroughly.\n\n- Plant grafted trees spaced at least 30 feet apart for adequate space, sun and air circulation.\n\n- Prune annually to shape trees, improve air flow and light penetration which maximizes fruiting.\n\n- Irrigate young trees regularly until established. Mature trees still need ample moisture during fruit season.",
      "harvesting_tips": "Harvesting durian fruit:\n\n- Monitor fruits for signs of peak ripeness like odor, yellowing stems, and slight yield when pressed.\n\n- Use clippers to detach ripe fruits carefully to avoid damaging branches or spikes from falling fruits.\n\n- Allow fruits to finish ripening for a day or two at room temperature after harvesting.\n\n- Open fruits by cutting along natural seam and prying apart. Remove seeds and enjoy flesh within 1-2 days.",
      "suggested_weather_to_plant": "Ideal conditions for durian trees:\n\n- Hot, humid tropical climate free of frost. Temperatures from 75-95°F year-round.\n\n- Heavy annual rainfall of 6 feet or more fairly evenly distributed.\n\n- Full sun exposure is essential. Durian needs at least 8 hours of direct sunlight daily.\n\n- Well-draining, fertile soil high in organic matter. Durian trees cannot tolerate soggy feet.",
      "tools_needed_to_plant": "- Bypass hand pruners for harvesting fruits without damaging branches.\n\n- Loppers for pruning and shaping large branches.\n\n- Spading fork for preparing deep soil beds.\n\n- Compost, organic fertilizer to prepare planting site.",
      "how_to_plant": "How to plant durian trees:\n\n- Select site with full sun, good drainage/airflow and shelter. Dig deep beds, mix in aged compost/manure thoroughly.\n\n- Obtain grafted saplings for faster fruiting. Space at least 30 feet apart each way.\n\n- Stake young trees and prune annually to shape. Irrigate regularly until established.\n\n- Expect 4-5 years from planting for trees to begin fruiting. Harvest ripe fruits promptly with pruners.",
      "fertilizer_to_use": "Good organic fertilizers for durian trees:\n\n- Compost, aged manure provides overall soil enrichment.\n\n- Balanced organic tree fertilizer annually each spring.\n\n- Fish emulsion or compost tea monthly during fruit season."
    }
  ]
}
